{
    "0": {
        "ticker": "META",
        "date_published": "2024-10-23",
        "title": "Goldman Sachs: Meta Platforms, Inc. (NASDAQ:META) Has Got Mutual & Hedge Fund Managers Divided",
        "summary": "We recently looked at Goldman Sachs’ List Of Stocks That Hedge & Mutual Funds Love & Hate: 28 Stocks On The Mutual and Hedge Funds Radar. In this piece, we will look at where Meta Platforms, Inc. (NASDAQ:META) sits on the fund managers’ radar. The surge in interest surrounding artificial intelligence has meant that the […]",
        "first_p": "We recently looked at Goldman Sachs’ List Of Stocks That Hedge & Mutual Funds Love & Hate: 28 Stocks On The Mutual and Hedge Funds Radar. In this piece, we will look at where Meta Platforms, Inc. (NASDAQ:META) sits on the fund managers' radar.",
        "last_p": "Polen Capital mentioned Meta Platforms, Inc. (NASDAQ:META) in its Q2 2024 investor letter. Here is what the fund said:"
    },
    "1": {
        "ticker": "META",
        "date_published": "2024-10-23",
        "title": "Goldman Sachs: Meta Platforms, Inc. (NASDAQ:META) Has Got Mutual & Hedge Fund Managers Divided",
        "summary": "We recently looked at Goldman Sachs’ List Of Stocks That Hedge & Mutual Funds Love & Hate: 28 Stocks On The Mutual and Hedge Funds Radar. In this piece, we will look at where Meta Platforms, Inc. (NASDAQ:META) sits on the fund managers’ radar. The surge in interest surrounding artificial intelligence has meant that the […]",
        "first_p": "Meta Platforms (META, Financials) and CEO Mark Zuckerberg won the rejection of a lawsuit alleging the business misled investors about its initiatives to guarantee the safety of youngsters using Facebook and Instagram, Reuters reported.",
        "last_p": "Breyer had already turned down Eisner's June effort to stop the conference, claiming that Meta's proxy's comments about its dedication to children's safety were aspirational and did not support legal action."
    },
    "2": {
        "ticker": "META",
        "date_published": "2024-10-23",
        "title": "Goldman Sachs: Meta Platforms, Inc. (NASDAQ:META) Has Got Mutual & Hedge Fund Managers Divided",
        "summary": "We recently looked at Goldman Sachs’ List Of Stocks That Hedge & Mutual Funds Love & Hate: 28 Stocks On The Mutual and Hedge Funds Radar. In this piece, we will look at where Meta Platforms, Inc. (NASDAQ:META) sits on the fund managers’ radar. The surge in interest surrounding artificial intelligence has meant that the […]",
        "first_p": "The third-quarter earnings season is underway, and the so-called “Magnificent 7\" or “Mag 7” companies are in focus again. These stock market darlings of the first half of 2024 lost their steam in recent months due to the fading AI craze and investors' love for the sectors benefiting the most from rate cuts.\n\nThe seven stocks comprising “Mag 7” are Tesla TSLA, Alphabet GOOGL, Meta Platforms META, Microsoft MSFT, Apple AAPL, Amazon AMZN and NVIDIA NVDA. Among the seven, Tesla will be the first to report, with its earnings release scheduled after market close today. Alphabet is scheduled to report on Oct. 29, followed by Microsoft and Meta Platforms on Oct. 30, and Apple and Amazon on Oct. 31. NVIDIA is likely to report next month.\n\nThird-quarter earnings of the “Mag 7” companies are expected to be up 16.2% from the same period last year on 13.6% higher revenues. In the second quarter, Mag 7 recorded 35.2% earnings growth on 14.7% higher revenues.\n\nStay up-to-date with all quarterly releases:See Zacks Earnings Calendar.",
        "last_p": "Alphabet Inc. (GOOGL) : Free Stock Analysis Report"
    },
    "3": {
        "ticker": "META",
        "date_published": "2024-10-23",
        "title": "Goldman Sachs: Meta Platforms, Inc. (NASDAQ:META) Has Got Mutual & Hedge Fund Managers Divided",
        "summary": "We recently looked at Goldman Sachs’ List Of Stocks That Hedge & Mutual Funds Love & Hate: 28 Stocks On The Mutual and Hedge Funds Radar. In this piece, we will look at where Meta Platforms, Inc. (NASDAQ:META) sits on the fund managers’ radar. The surge in interest surrounding artificial intelligence has meant that the […]",
        "first_p": "The third-quarter earnings season is underway, and the so-called “Magnificent 7\" companies are in focus. The “Mag 7,” the stock market darlings in the first half of 2024, lost their steam in recent months due to the fading AI craze and investors' love for the sectors benefiting the most from rate cuts.\n\nThe seven stocks are Apple (AAPL), Microsoft (MSFT), Alphabet (GOOG, GOOGL), Amazon (AMZN), NVIDIA (NVDA), Tesla (TSLA) and Meta Platforms (META). Among the seven, Tesla will be the first to report, with the release scheduled after market close today. Alphabet is scheduled to report on Oct. 29, followed by Microsoft and Meta Platforms on Oct. 30, and Apple and Amazon on Oct. 31. NVIDIA is likely to report next month.\n\nThe third-quarter earnings for the “Mag 7” companies are expected to be up 16.2% from the same period last year on 13.6% higher revenues. This would follow the 35.2% earnings growth on 14.7% higher revenues in the second quarter.\n\nStay up-to-date with all quarterly releases:See Zacks Earnings Calendar.\n\nTesla\n\nTesla has an Earnings ESP of -1.28% and a Zacks Rank #2 (Buy). According to our methodology, the combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 or 3 (Hold) increases the chances of an earnings beat. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.\n\nThe electric carmaker saw no earnings estimate revision over the past 30 days for the to-be-reported quarter. The Zacks Consensus Estimate for third-quarter earnings indicates a substantial year-over-year decline of 12.1% and revenue growth of 9.5%. The earnings track record of the company is not good as it delivered a four-quarter average negative earnings surprise of 7.99%. The electric carmaker is down 5.7% in the last three months (read: Should You Buy Tesla ETFs Ahead of Q3 Earnings?).\n\nTesla returned to delivery growth in the third quarter after two consecutive quarters of decline and reported the third-largest quarterly number in the company's history. Investors are keenly waiting for specifics on the company's plans for an affordable EV below $30,000 and its long-term Cybercab vision after the recent Robotaxi event, which left investors disappointed due to the lack of concrete details regarding its ridesharing platform.\n\nAlphabet\n\nAlphabet has an Earnings ESP of +1.57% and Zacks Rank #2. It saw no earnings estimate revision over the past 30 days for the to-be-reported quarter. The company’s earnings surprise track record over the past four quarters is good, with the average being 9.60%. Earnings are expected to increase 18.1%, while revenues are expected to grow 13.6% from the year-ago quarter. The Internet behemoth has plunged 9% in the last three months.\n\nGoogle is facing headwinds from antitrust lawsuits and intensifying competition in the AI space. Analysts are concerned about the impact of generative AI on Google's core search business.\n\nMeta Platforms\n\nMeta Platforms has an Earnings ESP of +2.83% and Zacks Rank #2. The social media giant saw a positive earnings estimate revision of 2 cents for the to-be-reported quarter over the past 30 days. Analysts increasing estimates right before earnings — with the most up-to-date information possible — is a good indicator for the stock. The Zacks Consensus Estimate for the yet-to-be-reported quarter indicates substantial year-over-year earnings growth of 17.8%. Revenues are expected to increase 17.6% year over year. Meta Platforms delivered an earnings surprise of 12.61%, on average, in the last four quarters. Shares of META have gained about 23.5% over the past three months.\n\nMeta Platform is trading near an all-time high and several analysts raised the target price for META ahead of its earnings, showing strong confidence in the company’s growth. UBS raised the price target to $690 from $635, maintaining a Buy rating, while Guggenheim raised Meta's price target to $665 from $600 with a Buy rating. Jefferies and TD Cowen lifted the price target on Meta Platforms to $675 from $600 each and kept a Buy rating. KeyBanc increased the price target to $655 from the previous $560 while maintaining an Overweight rating on the stock.\n\nAnalysts cited enhanced user engagement and better monetization of video content, including the Reels feature on the platform. An increased ad load and overall usage rate for its Reels (short-form-video) offering would \"continue to drive growth\" for Instagram.\n\nMicrosoft\n\nMicrosoft has an Earnings ESP of -0.74% and a Zacks Rank #3. Microsoft saw a positive earnings estimate revision of a penny over the past 30 days for the to-be-reported quarter. Its earnings track record is impressive, with the four-quarter earnings surprise being 6.34%, on average. The Zacks Consensus Estimate indicates earnings growth of 3% and revenue growth of 14% from the year-ago quarter. Microsoft has shed about 4% over the past three months.\n\nThe world's largest software company is spending billions to construct new data centers to meet demand for cloud computing and power-hungry AI services. While Azure growth will continue to slow in the current quarter, chief financial officer Amy Hood said that investments in data centers and servers will let the company capitalize on demand and accelerate Azure growth in the second half of fiscal 2025. Microsoft expects revenues of $63.8-$64.8 billion for the first quarter of fiscal 2025, implying 13.8% growth at the middle of the range.\n\nApple\n\nApple has an Earnings ESP of -17.71% and a Zacks Rank #3. Apple saw a negative earnings estimate revision of 6 cents over the past 30 days for the fiscal fourth quarter. The iPhone maker has a strong track record of positive earnings surprises. It delivered an average earnings surprise of 3.79% in the trailing four quarters. The Zacks Consensus Estimate indicates a modest year-over-year increase of 5.5% for earnings and 5.6% for revenues. The stock is up 4.9% over the past three months.\n\nThe iPhone manufacturer returned to revenue growth in fiscal third-quarter 2024 and introduced four versions of iPhone 16 based on AI last month. The new AI-based iPhones will likely kickstart the next big upgrade cycle, enhancing the company's performance and restoring investor confidence in Apple. The stock touched a new high this week on improving demand for its latest iPhone 16. The preliminary iPhone shipment data posted by International Data Corporation showed strong demand for Apple's previous smartphone models. Sales were also helped by Apple's rollout of iPhone 16 (read: ETFs to Tap Apple's Potential AI-Based Growth).\n\nAmazon\n\nAmazon has an Earnings ESP of 0.00% and a Zacks Rank #3. The stock saw no earnings estimate revision over the past 30 days for the third quarter. The Zacks Consensus Estimate indicates a year-over-year earnings increase of 34.1% and substantial revenue growth of 9.8% for the to-be-reported quarter. Additionally, Amazon’s earnings surprise history is impressive, with the four-quarter average surprise being 31.1%. The stock has gained about 1.8% in the past three months.\n\nAmazon remains the king of e-commerce, and its advertising unit is booming. The growth in Amazon’s cloud computing business — Amazon Web Services (“AWS”) — is also accelerating, driven by its AI capabilities. Like other tech companies, Amazon has been ramping up investments in data centers, chips and the power needed for AI workloads. The world's largest online retailer expects revenues in the range of $154-$158.5 billion for the third quarter of 2024.",
        "last_p": "iShares S&P 100 ETF (OEF): ETF Research Reports"
    },
    "4": {
        "ticker": "META",
        "date_published": "2024-10-23",
        "title": "Goldman Sachs: Meta Platforms, Inc. (NASDAQ:META) Has Got Mutual & Hedge Fund Managers Divided",
        "summary": "We recently looked at Goldman Sachs’ List Of Stocks That Hedge & Mutual Funds Love & Hate: 28 Stocks On The Mutual and Hedge Funds Radar. In this piece, we will look at where Meta Platforms, Inc. (NASDAQ:META) sits on the fund managers’ radar. The surge in interest surrounding artificial intelligence has meant that the […]",
        "first_p": "The market expects Meta Platforms (META) to deliver a year-over-year increase in earnings on higher revenues when it reports results for the quarter ended September 2024. This widely-known consensus outlook is important in assessing the company's earnings picture, but a powerful factor that might influence its near-term stock price is how the actual results compare to these estimates.",
        "last_p": "Meta Platforms, Inc. (META) : Free Stock Analysis Report"
    },
    "5": {
        "ticker": "META",
        "date_published": "2024-10-23",
        "title": "Goldman Sachs: Meta Platforms, Inc. (NASDAQ:META) Has Got Mutual & Hedge Fund Managers Divided",
        "summary": "We recently looked at Goldman Sachs’ List Of Stocks That Hedge & Mutual Funds Love & Hate: 28 Stocks On The Mutual and Hedge Funds Radar. In this piece, we will look at where Meta Platforms, Inc. (NASDAQ:META) sits on the fund managers’ radar. The surge in interest surrounding artificial intelligence has meant that the […]",
        "first_p": "Listen and subscribe to Opening Bid on Apple Podcasts, Spotify, or wherever you find your favorite podcasts.",
        "last_p": "\"As it relates to AI writ large, I mean, this is a secular change,\" Siebel said. \"This is not ephemeral. It's a genuine big deal.\""
    },
    "6": {
        "ticker": "META",
        "date_published": "2024-10-23",
        "title": "Goldman Sachs: Meta Platforms, Inc. (NASDAQ:META) Has Got Mutual & Hedge Fund Managers Divided",
        "summary": "We recently looked at Goldman Sachs’ List Of Stocks That Hedge & Mutual Funds Love & Hate: 28 Stocks On The Mutual and Hedge Funds Radar. In this piece, we will look at where Meta Platforms, Inc. (NASDAQ:META) sits on the fund managers’ radar. The surge in interest surrounding artificial intelligence has meant that the […]",
        "first_p": "(Bloomberg) -- Meta Platforms Inc. is losing third-party augmented reality developers to rival Snap Inc. following the social media giant’s unexpected decision to shutter its AR studio.",
        "last_p": "Who Thinks China’s Not an Economic Powerhouse? China"
    },
    "7": {
        "ticker": "META",
        "date_published": "2024-10-23",
        "title": "Goldman Sachs: Meta Platforms, Inc. (NASDAQ:META) Has Got Mutual & Hedge Fund Managers Divided",
        "summary": "We recently looked at Goldman Sachs’ List Of Stocks That Hedge & Mutual Funds Love & Hate: 28 Stocks On The Mutual and Hedge Funds Radar. In this piece, we will look at where Meta Platforms, Inc. (NASDAQ:META) sits on the fund managers’ radar. The surge in interest surrounding artificial intelligence has meant that the […]",
        "first_p": "By Katie Paul",
        "last_p": "The case highlights the fine line the world's biggest social media platform must walk in moderating posts pertaining to the highly charged U.S. political environment. Conservatives frequently complain that the platform removes too much of their content, while progressives generally say it does too little to police misinformation and abuse on properties Facebook, Instagram, WhatsApp and Threads."
    },
    "8": {
        "ticker": "META",
        "date_published": "2024-10-23",
        "title": "Goldman Sachs: Meta Platforms, Inc. (NASDAQ:META) Has Got Mutual & Hedge Fund Managers Divided",
        "summary": "We recently looked at Goldman Sachs’ List Of Stocks That Hedge & Mutual Funds Love & Hate: 28 Stocks On The Mutual and Hedge Funds Radar. In this piece, we will look at where Meta Platforms, Inc. (NASDAQ:META) sits on the fund managers’ radar. The surge in interest surrounding artificial intelligence has meant that the […]",
        "first_p": "This is The Takeaway from today's Morning Brief, which you can sign up to receive in your inbox every morning along with:",
        "last_p": "Even if that $206 billion in investment — set to be $235 billion next year — is expensive, there are two big potential macro benefits on the table."
    },
    "9": {
        "ticker": "META",
        "date_published": "2024-10-23",
        "title": "Goldman Sachs: Meta Platforms, Inc. (NASDAQ:META) Has Got Mutual & Hedge Fund Managers Divided",
        "summary": "We recently looked at Goldman Sachs’ List Of Stocks That Hedge & Mutual Funds Love & Hate: 28 Stocks On The Mutual and Hedge Funds Radar. In this piece, we will look at where Meta Platforms, Inc. (NASDAQ:META) sits on the fund managers’ radar. The surge in interest surrounding artificial intelligence has meant that the […]",
        "first_p": "We recently compiled a list of the 15 AI News Investors Should Not Miss. In this article, we are going to take a look at where Meta Platforms, Inc. (NASDAQ:META) stands against the other AI stocks investors should not miss.",
        "last_p": ""
    },
    "10": {
        "ticker": "META",
        "date_published": "2024-10-23",
        "title": "Goldman Sachs: Meta Platforms, Inc. (NASDAQ:META) Has Got Mutual & Hedge Fund Managers Divided",
        "summary": "We recently looked at Goldman Sachs’ List Of Stocks That Hedge & Mutual Funds Love & Hate: 28 Stocks On The Mutual and Hedge Funds Radar. In this piece, we will look at where Meta Platforms, Inc. (NASDAQ:META) sits on the fund managers’ radar. The surge in interest surrounding artificial intelligence has meant that the […]",
        "first_p": "We recently compiled a list of the 15 AI News Investors Should Not Miss. In this article, we are going to take a look at where Lumen Technologies, Inc. (NYSE:LUMN) stands against the other AI stocks investors should not miss.",
        "last_p": ""
    },
    "11": {
        "ticker": "AAPL",
        "date_published": "2024-10-24",
        "title": "Apple stock slips after a big cut for iPhone 16 orders",
        "summary": "Shares of Apple (AAPL) closed down 2.16% on Wednesday after a report that the iPhone maker cut orders for its latest version by millions of units.",
        "first_p": "HONG KONG (Reuters) -Apple CEO Tim Cook said at a meeting with the Chinese government in Beijing that the U.S. company will increase investment in China and thereby contribute to supply chain development, state news agency Xinhua reported on Thursday.",
        "last_p": "\"Apple is keen to seize the opportunities presented by China's opening up and will continue to increase its investment in the country, thus contributing to the high-quality development of the industrial and supply chains,\" Cook was quoted as saying by Xinhua."
    },
    "12": {
        "ticker": "AAPL",
        "date_published": "2024-10-23",
        "title": "Apple stock slips after a big cut for iPhone 16 orders",
        "summary": "Shares of Apple (AAPL) closed down 2.16% on Wednesday after a report that the iPhone maker cut orders for its latest version by millions of units.",
        "first_p": "The Consumer Financial Protection Bureau (CFPB) on Wednesday ordered Apple and Goldman Sachs to pay $89 million over mishandled transaction disputes and misrepresentations that impacted hundreds of thousands of\nApple Card\nusers.",
        "last_p": "In November 2023,\nThe Wall Street Journal reported\nthat Apple proposed ending its credit card partnership with Goldman Sachs in the next 12 to 15 months."
    },
    "13": {
        "ticker": "AAPL",
        "date_published": "2024-10-23",
        "title": "Apple stock slips after a big cut for iPhone 16 orders",
        "summary": "Shares of Apple (AAPL) closed down 2.16% on Wednesday after a report that the iPhone maker cut orders for its latest version by millions of units.",
        "first_p": "NEW YORK (AP) — A federal regulator on Wednesday ordered Apple and Goldman Sachs to pay a combined $89 million for deceiving consumers and mishandled transaction disputes of Apple Card customers.",
        "last_p": "“These failures are not mere technicalities. They resulted in real harm to real people,” CFPB Director Rohit Chopra said in prepared remarks, noting hundreds of thousands of Apple Card users were impacted overall. In a separate statement, he added that “Big Tech companies and big Wall Street firms should not behave as if they are exempt from federal law.”"
    },
    "14": {
        "ticker": "AAPL",
        "date_published": "2024-10-23",
        "title": "Apple stock slips after a big cut for iPhone 16 orders",
        "summary": "Shares of Apple (AAPL) closed down 2.16% on Wednesday after a report that the iPhone maker cut orders for its latest version by millions of units.",
        "first_p": "We recently looked at Goldman Sachs’ List Of Stocks That Hedge & Mutual Funds Love & Hate: 28 Stocks On The Mutual and Hedge Funds Radar. In this piece, we will look at where Apple Inc. (NASDAQ:AAPL) sits on the fund managers' radar.",
        "last_p": "Baron Funds mentioned Apple Inc. (NASDAQ:AAPL) in its Q2 2024 investor letter. Here is what the firm said:"
    },
    "15": {
        "ticker": "AAPL",
        "date_published": "2024-10-23",
        "title": "Apple stock slips after a big cut for iPhone 16 orders",
        "summary": "Shares of Apple (AAPL) closed down 2.16% on Wednesday after a report that the iPhone maker cut orders for its latest version by millions of units.",
        "first_p": "Shares of iPhone and iPad maker Apple (NASDAQ:AAPL) fell 3.3% in the afternoon session after an industry survey conducted by TF International Securities analyst, Ming-Chi Kuo, revealed that iPhone 16 orders were cut by about 10 million units from the fourth quarter of 2024 through the first half of 2025. Kuo, known for his often spot-on predictions on Apple, is in the bearish camp, suggesting demand for the new iPhone models might not be as strong as initially anticipated.",
        "last_p": "The previous big move we wrote about was 22 days ago when the stock dropped 3.6% as the major indices declined (Nasdaq down 1.8%, S&P 500 down 0.9%) amid rising geopolitical tensions in the Middle East. NBC News reported (citing White House and Defense Department officials) that the U.S. \"has indications that Iran is preparing to imminently launch a ballistic missile attack against Israel.\""
    },
    "16": {
        "ticker": "AAPL",
        "date_published": "2024-10-23",
        "title": "Apple stock slips after a big cut for iPhone 16 orders",
        "summary": "Shares of Apple (AAPL) closed down 2.16% on Wednesday after a report that the iPhone maker cut orders for its latest version by millions of units.",
        "first_p": "Following a meeting with Jin Zhuanglong, Minister of Industry and Information Technology, Apple (AAPL, Financials) CEO Tim Cook promised further investment in China, according to a government WeChat statement. Cook underlined Apple's intentions to increase its Chinese investment and stressed the company's responsibility in helping the Chinese supply chain to grow.",
        "last_p": "Particularly in areas like cloud services and safe data management, Jin Zhuanglong advised Cook to have a strong presence in China and concentrate on more inventions. The conference underlined China's continuous attempts to attract international capital in the face of economic uncertainty."
    },
    "17": {
        "ticker": "AAPL",
        "date_published": "2024-10-23",
        "title": "Apple stock slips after a big cut for iPhone 16 orders",
        "summary": "Shares of Apple (AAPL) closed down 2.16% on Wednesday after a report that the iPhone maker cut orders for its latest version by millions of units.",
        "first_p": "(Bloomberg) -- The Reserve Bank of New Zealand’s Monetary Policy Committee is still thinking about lingering price pressures, even as it cuts interest rates to reflect a lower inflation outlook, Governor Adrian Orr said.",
        "last_p": "Who Thinks China’s Not an Economic Powerhouse? China"
    },
    "18": {
        "ticker": "AAPL",
        "date_published": "2024-10-23",
        "title": "Apple stock slips after a big cut for iPhone 16 orders",
        "summary": "Shares of Apple (AAPL) closed down 2.16% on Wednesday after a report that the iPhone maker cut orders for its latest version by millions of units.",
        "first_p": "Following a report from TF International Securities analyst Ming-Chi Kuo showing iPhone 16 orders being cut by roughly 10 million devices for the next few quarters, Apple (NASDAQ:AAPL) stock dipped 1.8% on Wednesday. Kuo pointed out that the cuts affected non-pro models mainly.",
        "last_p": "\"iPhone 16 orders were cut by around 10 million units for 4Q241H25, most of the cuts affecting non-Pro models,\" Kuo stated on his blog. Consequently, from a previous estimate of around 88 million units, production for the later half of 2024 is now expected to be 84 million units."
    },
    "19": {
        "ticker": "AAPL",
        "date_published": "2024-10-23",
        "title": "Apple stock slips after a big cut for iPhone 16 orders",
        "summary": "Shares of Apple (AAPL) closed down 2.16% on Wednesday after a report that the iPhone maker cut orders for its latest version by millions of units.",
        "first_p": "Investing.com -- Apple fell Wednesday after Market analyst Ming-Chi Kuo at TF International, known for his knack of nailing predictions on Apple, delivered a gloomy update on iPhone 16 demand, saying the tech giant has cut a total of 10 million orders for the fourth quarter of 2024 through the first half of 2025.",
        "last_p": "Related Articles"
    },
    "20": {
        "ticker": "AAPL",
        "date_published": "2024-10-23",
        "title": "Apple stock slips after a big cut for iPhone 16 orders",
        "summary": "Shares of Apple (AAPL) closed down 2.16% on Wednesday after a report that the iPhone maker cut orders for its latest version by millions of units.",
        "first_p": "The long breakup between Apple and Goldman Sachs over their joint credit card has become even messier. The Consumer Financial Protection Bureau announced on Wednesday that it had ordered both companies to pay a total of $89 million for allegedly mishandling disputed transactions and misleading consumers about interest-free payment plans for iPhones and other Apple devices.",
        "last_p": "“We worked diligently to address certain technological and operational challenges that we experienced after launch and have already handled them with impacted customers,” company spokesperson Nick Carcaterra said in a statement."
    },
    "21": {
        "ticker": "AMZN",
        "date_published": "2024-10-23",
        "title": "WSJ Tech Live: Executives, Investors and Artists Debate AI’s Potential",
        "summary": "At WSJ’s Tech Live, actor Joseph Gordon-Levitt said that while he thinks humans will still make great art, he worries that AI will inundate people with ‘mind-numbing’ content.  Executives, investors and entertainers gathered at The Wall Street Journal’s Tech Live to discuss the merits and risks of artificial intelligence, election security and cyber threats facing America, and how the power grid can keep pace with the growing demands of new technology.",
        "first_p": "Amazon Prime members now have a benefit that will help them see savings when filling up their gas tank.",
        "last_p": "The U.S. saw a record-high average price of $5.016 for a gallon of regular unleaded gas in mid-June of 2022, per AAA."
    },
    "22": {
        "ticker": "AMZN",
        "date_published": "2024-10-23",
        "title": "WSJ Tech Live: Executives, Investors and Artists Debate AI’s Potential",
        "summary": "At WSJ’s Tech Live, actor Joseph Gordon-Levitt said that while he thinks humans will still make great art, he worries that AI will inundate people with ‘mind-numbing’ content.  Executives, investors and entertainers gathered at The Wall Street Journal’s Tech Live to discuss the merits and risks of artificial intelligence, election security and cyber threats facing America, and how the power grid can keep pace with the growing demands of new technology.",
        "first_p": "Artificial Intelligence has driven shares of tech companies like Microsoft (MSFT), Amazon (AMZN), Nvidia (NVDA), and Google (GOOG, GOOGL) to new highs this year. But the technology, which companies promise will revolutionize our lives, is driving something else just as high as stock prices: energy consumption.",
        "last_p": "Still, with tech companies promising an AI revolution that requires power-hungry data centers, nuclear may be the only realistic green choice until solar and wind can take over permanently."
    },
    "23": {
        "ticker": "AMZN",
        "date_published": "2024-10-23",
        "title": "WSJ Tech Live: Executives, Investors and Artists Debate AI’s Potential",
        "summary": "At WSJ’s Tech Live, actor Joseph Gordon-Levitt said that while he thinks humans will still make great art, he worries that AI will inundate people with ‘mind-numbing’ content.  Executives, investors and entertainers gathered at The Wall Street Journal’s Tech Live to discuss the merits and risks of artificial intelligence, election security and cyber threats facing America, and how the power grid can keep pace with the growing demands of new technology.",
        "first_p": "We recently looked at Goldman Sachs’ List Of Stocks That Hedge & Mutual Funds Love & Hate: 28 Stocks On The Mutual and Hedge Funds Radar. In this piece, we will look at where Amazon.com, Inc. (NASDAQ:AMZN) sits on the fund managers' radar.",
        "last_p": "Patient Capital Management mentioned Amazon.com, Inc. (NASDAQ:AMZN) in its Q2 2024 investor letter. Here is what the fund said:"
    },
    "24": {
        "ticker": "AMZN",
        "date_published": "2024-10-23",
        "title": "WSJ Tech Live: Executives, Investors and Artists Debate AI’s Potential",
        "summary": "At WSJ’s Tech Live, actor Joseph Gordon-Levitt said that while he thinks humans will still make great art, he worries that AI will inundate people with ‘mind-numbing’ content.  Executives, investors and entertainers gathered at The Wall Street Journal’s Tech Live to discuss the merits and risks of artificial intelligence, election security and cyber threats facing America, and how the power grid can keep pace with the growing demands of new technology.",
        "first_p": "The third-quarter earnings season is underway, and the so-called “Magnificent 7\" or “Mag 7” companies are in focus again. These stock market darlings of the first half of 2024 lost their steam in recent months due to the fading AI craze and investors' love for the sectors benefiting the most from rate cuts.\n\nThe seven stocks comprising “Mag 7” are Tesla TSLA, Alphabet GOOGL, Meta Platforms META, Microsoft MSFT, Apple AAPL, Amazon AMZN and NVIDIA NVDA. Among the seven, Tesla will be the first to report, with its earnings release scheduled after market close today. Alphabet is scheduled to report on Oct. 29, followed by Microsoft and Meta Platforms on Oct. 30, and Apple and Amazon on Oct. 31. NVIDIA is likely to report next month.\n\nThird-quarter earnings of the “Mag 7” companies are expected to be up 16.2% from the same period last year on 13.6% higher revenues. In the second quarter, Mag 7 recorded 35.2% earnings growth on 14.7% higher revenues.\n\nStay up-to-date with all quarterly releases:See Zacks Earnings Calendar.",
        "last_p": "Alphabet Inc. (GOOGL) : Free Stock Analysis Report"
    },
    "25": {
        "ticker": "AMZN",
        "date_published": "2024-10-23",
        "title": "WSJ Tech Live: Executives, Investors and Artists Debate AI’s Potential",
        "summary": "At WSJ’s Tech Live, actor Joseph Gordon-Levitt said that while he thinks humans will still make great art, he worries that AI will inundate people with ‘mind-numbing’ content.  Executives, investors and entertainers gathered at The Wall Street Journal’s Tech Live to discuss the merits and risks of artificial intelligence, election security and cyber threats facing America, and how the power grid can keep pace with the growing demands of new technology.",
        "first_p": "Amazon (AMZN, Financial) is scheduled to release its third-quarter financial results on October 31, 2024, and investors are keenly watching the performance, particularly in the high-margin services, which include AWS. Building up from a second quarter that essentially fired on all cylinders in terms of earnings per share, although missing its revenue estimates slightly, the e-commerce titan is under pressure to deliver continued results and smooth market concerns about its spending.",
        "last_p": "Specifically, while the quarterly figures fell slightly short of the $148.8 billion predicted by market gurus, Amazon nonetheless recorded gross sales of $148 billion in Q2; at the same time, Amazon found a way to almost double its operating income to $14.7 billion of which AWS rose by 19% YoY. This growth stood at a 1% point higher than Wall Street's projection of $17.5 billion. This testifies to the centrality of AWS to Amazon's revenue plan. However, the merchandise stock fell by as much as 8% after its earnings release, mainly boosted by a bleak forecasted profit for the subsequent quarter and unrealistic market expectations."
    },
    "26": {
        "ticker": "AMZN",
        "date_published": "2024-10-23",
        "title": "WSJ Tech Live: Executives, Investors and Artists Debate AI’s Potential",
        "summary": "At WSJ’s Tech Live, actor Joseph Gordon-Levitt said that while he thinks humans will still make great art, he worries that AI will inundate people with ‘mind-numbing’ content.  Executives, investors and entertainers gathered at The Wall Street Journal’s Tech Live to discuss the merits and risks of artificial intelligence, election security and cyber threats facing America, and how the power grid can keep pace with the growing demands of new technology.",
        "first_p": "The third-quarter earnings season is underway, and the so-called “Magnificent 7\" companies are in focus. The “Mag 7,” the stock market darlings in the first half of 2024, lost their steam in recent months due to the fading AI craze and investors' love for the sectors benefiting the most from rate cuts.\n\nThe seven stocks are Apple (AAPL), Microsoft (MSFT), Alphabet (GOOG, GOOGL), Amazon (AMZN), NVIDIA (NVDA), Tesla (TSLA) and Meta Platforms (META). Among the seven, Tesla will be the first to report, with the release scheduled after market close today. Alphabet is scheduled to report on Oct. 29, followed by Microsoft and Meta Platforms on Oct. 30, and Apple and Amazon on Oct. 31. NVIDIA is likely to report next month.\n\nThe third-quarter earnings for the “Mag 7” companies are expected to be up 16.2% from the same period last year on 13.6% higher revenues. This would follow the 35.2% earnings growth on 14.7% higher revenues in the second quarter.\n\nStay up-to-date with all quarterly releases:See Zacks Earnings Calendar.\n\nTesla\n\nTesla has an Earnings ESP of -1.28% and a Zacks Rank #2 (Buy). According to our methodology, the combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 or 3 (Hold) increases the chances of an earnings beat. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.\n\nThe electric carmaker saw no earnings estimate revision over the past 30 days for the to-be-reported quarter. The Zacks Consensus Estimate for third-quarter earnings indicates a substantial year-over-year decline of 12.1% and revenue growth of 9.5%. The earnings track record of the company is not good as it delivered a four-quarter average negative earnings surprise of 7.99%. The electric carmaker is down 5.7% in the last three months (read: Should You Buy Tesla ETFs Ahead of Q3 Earnings?).\n\nTesla returned to delivery growth in the third quarter after two consecutive quarters of decline and reported the third-largest quarterly number in the company's history. Investors are keenly waiting for specifics on the company's plans for an affordable EV below $30,000 and its long-term Cybercab vision after the recent Robotaxi event, which left investors disappointed due to the lack of concrete details regarding its ridesharing platform.\n\nAlphabet\n\nAlphabet has an Earnings ESP of +1.57% and Zacks Rank #2. It saw no earnings estimate revision over the past 30 days for the to-be-reported quarter. The company’s earnings surprise track record over the past four quarters is good, with the average being 9.60%. Earnings are expected to increase 18.1%, while revenues are expected to grow 13.6% from the year-ago quarter. The Internet behemoth has plunged 9% in the last three months.\n\nGoogle is facing headwinds from antitrust lawsuits and intensifying competition in the AI space. Analysts are concerned about the impact of generative AI on Google's core search business.\n\nMeta Platforms\n\nMeta Platforms has an Earnings ESP of +2.83% and Zacks Rank #2. The social media giant saw a positive earnings estimate revision of 2 cents for the to-be-reported quarter over the past 30 days. Analysts increasing estimates right before earnings — with the most up-to-date information possible — is a good indicator for the stock. The Zacks Consensus Estimate for the yet-to-be-reported quarter indicates substantial year-over-year earnings growth of 17.8%. Revenues are expected to increase 17.6% year over year. Meta Platforms delivered an earnings surprise of 12.61%, on average, in the last four quarters. Shares of META have gained about 23.5% over the past three months.\n\nMeta Platform is trading near an all-time high and several analysts raised the target price for META ahead of its earnings, showing strong confidence in the company’s growth. UBS raised the price target to $690 from $635, maintaining a Buy rating, while Guggenheim raised Meta's price target to $665 from $600 with a Buy rating. Jefferies and TD Cowen lifted the price target on Meta Platforms to $675 from $600 each and kept a Buy rating. KeyBanc increased the price target to $655 from the previous $560 while maintaining an Overweight rating on the stock.\n\nAnalysts cited enhanced user engagement and better monetization of video content, including the Reels feature on the platform. An increased ad load and overall usage rate for its Reels (short-form-video) offering would \"continue to drive growth\" for Instagram.\n\nMicrosoft\n\nMicrosoft has an Earnings ESP of -0.74% and a Zacks Rank #3. Microsoft saw a positive earnings estimate revision of a penny over the past 30 days for the to-be-reported quarter. Its earnings track record is impressive, with the four-quarter earnings surprise being 6.34%, on average. The Zacks Consensus Estimate indicates earnings growth of 3% and revenue growth of 14% from the year-ago quarter. Microsoft has shed about 4% over the past three months.\n\nThe world's largest software company is spending billions to construct new data centers to meet demand for cloud computing and power-hungry AI services. While Azure growth will continue to slow in the current quarter, chief financial officer Amy Hood said that investments in data centers and servers will let the company capitalize on demand and accelerate Azure growth in the second half of fiscal 2025. Microsoft expects revenues of $63.8-$64.8 billion for the first quarter of fiscal 2025, implying 13.8% growth at the middle of the range.\n\nApple\n\nApple has an Earnings ESP of -17.71% and a Zacks Rank #3. Apple saw a negative earnings estimate revision of 6 cents over the past 30 days for the fiscal fourth quarter. The iPhone maker has a strong track record of positive earnings surprises. It delivered an average earnings surprise of 3.79% in the trailing four quarters. The Zacks Consensus Estimate indicates a modest year-over-year increase of 5.5% for earnings and 5.6% for revenues. The stock is up 4.9% over the past three months.\n\nThe iPhone manufacturer returned to revenue growth in fiscal third-quarter 2024 and introduced four versions of iPhone 16 based on AI last month. The new AI-based iPhones will likely kickstart the next big upgrade cycle, enhancing the company's performance and restoring investor confidence in Apple. The stock touched a new high this week on improving demand for its latest iPhone 16. The preliminary iPhone shipment data posted by International Data Corporation showed strong demand for Apple's previous smartphone models. Sales were also helped by Apple's rollout of iPhone 16 (read: ETFs to Tap Apple's Potential AI-Based Growth).\n\nAmazon\n\nAmazon has an Earnings ESP of 0.00% and a Zacks Rank #3. The stock saw no earnings estimate revision over the past 30 days for the third quarter. The Zacks Consensus Estimate indicates a year-over-year earnings increase of 34.1% and substantial revenue growth of 9.8% for the to-be-reported quarter. Additionally, Amazon’s earnings surprise history is impressive, with the four-quarter average surprise being 31.1%. The stock has gained about 1.8% in the past three months.\n\nAmazon remains the king of e-commerce, and its advertising unit is booming. The growth in Amazon’s cloud computing business — Amazon Web Services (“AWS”) — is also accelerating, driven by its AI capabilities. Like other tech companies, Amazon has been ramping up investments in data centers, chips and the power needed for AI workloads. The world's largest online retailer expects revenues in the range of $154-$158.5 billion for the third quarter of 2024.",
        "last_p": "iShares S&P 100 ETF (OEF): ETF Research Reports"
    },
    "27": {
        "ticker": "AMZN",
        "date_published": "2024-10-23",
        "title": "WSJ Tech Live: Executives, Investors and Artists Debate AI’s Potential",
        "summary": "At WSJ’s Tech Live, actor Joseph Gordon-Levitt said that while he thinks humans will still make great art, he worries that AI will inundate people with ‘mind-numbing’ content.  Executives, investors and entertainers gathered at The Wall Street Journal’s Tech Live to discuss the merits and risks of artificial intelligence, election security and cyber threats facing America, and how the power grid can keep pace with the growing demands of new technology.",
        "first_p": "The Estee Lauder Companies Inc.'s EL flagship brand, Estee Lauder, has officially debuted its brand in the U.S. Amazon Premium Beauty store, making its high-performance skincare, makeup and iconic fragrances more accessible to a broader audience. Amazon AMZN customers can now shop for Estee Lauder's offerings at amazon.com/esteelauder.\n\nThis launch not only brings the brand’s products to Amazon shoppers but also introduces an exclusive Virtual Foundation Tool at amazon.com/findyourdoublewear that helps customers find their perfect foundation shade from the comfort of their homes. Amazon Prime members will also receive quick and free shipping on all purchases when shopping for Estee Lauder products in the Amazon Premium Beauty store.",
        "last_p": "Urban Outfitters, Inc. (URBN) : Free Stock Analysis Report"
    },
    "28": {
        "ticker": "AMZN",
        "date_published": "2024-10-23",
        "title": "WSJ Tech Live: Executives, Investors and Artists Debate AI’s Potential",
        "summary": "At WSJ’s Tech Live, actor Joseph Gordon-Levitt said that while he thinks humans will still make great art, he worries that AI will inundate people with ‘mind-numbing’ content.  Executives, investors and entertainers gathered at The Wall Street Journal’s Tech Live to discuss the merits and risks of artificial intelligence, election security and cyber threats facing America, and how the power grid can keep pace with the growing demands of new technology.",
        "first_p": "Q2 Holdings (QTWO) announced an expanded strategic partnership with Amazon Web Services (AMZN) to continue driving innovation for its bank, credit union, and fintech customers. As part of this collaboration, AWS and Presidio, a technology services and solutions provider and a premier consulting partner within the Amazon Partner Network, will help Q2 expand the use of the AWS platform to power its digital banking product, including Q2 Innovation Studio solutions. Q2 will leverage AWS innovation, including generative artificial intelligence technology, for its solution suite to help financial institutions automate critical and repetitive processes and better serve their consumer and business customers, the companies said in a statement.",
        "last_p": "Jonathan A. Price Named CFO in Q2 Holdings Leadership Shift"
    },
    "29": {
        "ticker": "AMZN",
        "date_published": "2024-10-23",
        "title": "WSJ Tech Live: Executives, Investors and Artists Debate AI’s Potential",
        "summary": "At WSJ’s Tech Live, actor Joseph Gordon-Levitt said that while he thinks humans will still make great art, he worries that AI will inundate people with ‘mind-numbing’ content.  Executives, investors and entertainers gathered at The Wall Street Journal’s Tech Live to discuss the merits and risks of artificial intelligence, election security and cyber threats facing America, and how the power grid can keep pace with the growing demands of new technology.",
        "first_p": "BMO Capital keeps an Outperform rating and $230 price target on Amazon.com (AMZN) while raising the firm’s Q3 AWS Cloud growth to 20% from 19%. BMO is also raising its FY24 EPS view on Amazon by 4c to $4.53 and its FY25 view by 3c to $5.30. The firm sees acceleration potential ahead for the company given the optimization normalization in the second half of 2024 and continued Bedrock adoption, though it also warns that the consumer trade-down effect remains the largest variable in the second half of the year, with mixed checks that include a solid back-to-school spend being offset by slowing beauty/electronics/home.",
        "last_p": "Estee Lauder announces U.S. Amazon Premium Beauty Store debut"
    },
    "30": {
        "ticker": "AMZN",
        "date_published": "2024-10-23",
        "title": "WSJ Tech Live: Executives, Investors and Artists Debate AI’s Potential",
        "summary": "At WSJ’s Tech Live, actor Joseph Gordon-Levitt said that while he thinks humans will still make great art, he worries that AI will inundate people with ‘mind-numbing’ content.  Executives, investors and entertainers gathered at The Wall Street Journal’s Tech Live to discuss the merits and risks of artificial intelligence, election security and cyber threats facing America, and how the power grid can keep pace with the growing demands of new technology.",
        "first_p": "We recently published a list of 10 Stocks with Consistent Growth to Buy. In this article, we are going to take a look at where Amazon.com Inc. (NASDAQ:AMZN) stands against other stocks with consistent growth to buy.",
        "last_p": "According to Insider Monkey’s database, Amazon.com Inc. (NASDAQ:AMZN) has attracted increased interest from institutional investors, with 308 hedge funds holding stakes in the company as of Q2 2024, up from 302 in Q1 2024."
    },
    "31": {
        "ticker": "AMZN",
        "date_published": "2024-10-23",
        "title": "WSJ Tech Live: Executives, Investors and Artists Debate AI’s Potential",
        "summary": "At WSJ’s Tech Live, actor Joseph Gordon-Levitt said that while he thinks humans will still make great art, he worries that AI will inundate people with ‘mind-numbing’ content.  Executives, investors and entertainers gathered at The Wall Street Journal’s Tech Live to discuss the merits and risks of artificial intelligence, election security and cyber threats facing America, and how the power grid can keep pace with the growing demands of new technology.",
        "first_p": "Cathie Wood, CEO of Ark Investment Management, is well-known for her focus on small- and mid-cap technology stocks. She came to fame after Ark Innovation ETF ARKK delivered a remarkable 73% return in 2020.",
        "last_p": "ARK Innovation ETF (ARKK): ETF Research Reports"
    },
    "32": {
        "ticker": "NFLX",
        "date_published": "2024-10-23",
        "title": "Netflix (NFLX): Sustaining Growth with Original Content and Advertising Expansion",
        "summary": "We recently published a list of 10 Stocks with Consistent Growth to Buy. In this article, we are going to take a look at where Netflix Inc. (NASDAQ:NFLX) stands against other stocks with consistent growth to buy. Currently, financial markets are experiencing a mix of optimism and caution as investors react to changing economic conditions. […]",
        "first_p": "We recently published a list of 10 Stocks with Consistent Growth to Buy. In this article, we are going to take a look at where Netflix Inc. (NASDAQ:NFLX) stands against other stocks with consistent growth to buy.",
        "last_p": "According to Insider Monkey’s Q2 2024 database of over 900 hedge funds, 103 hedge funds held stakes in Netflix Inc. (NASDAQ:NFLX)."
    },
    "33": {
        "ticker": "NFLX",
        "date_published": "2024-10-22",
        "title": "Netflix (NFLX): Sustaining Growth with Original Content and Advertising Expansion",
        "summary": "We recently published a list of 10 Stocks with Consistent Growth to Buy. In this article, we are going to take a look at where Netflix Inc. (NASDAQ:NFLX) stands against other stocks with consistent growth to buy. Currently, financial markets are experiencing a mix of optimism and caution as investors react to changing economic conditions. […]",
        "first_p": "Netflix's stock has surged by over 80% year-on-year, adding to its illustrious success story. Although consistent product uptake and successful company-level execution likely warrant its latest gains, revising Netflix's stock might be prudent as headwinds have emerged. For example, streaming-as-a-concept has matured, concurrently enhancing Netflix's competitive environment. Moreover, Netflix's stock has outperformed most high-beta technology stocks in the past year, suggesting mean reversion is possible.",
        "last_p": "Furthermore, Netflix possesses overlooked tailwinds from cross-selling its gaming division, delivering curated products to its various segments, and possessing best-in-class corporate partnerships."
    },
    "34": {
        "ticker": "NFLX",
        "date_published": "2024-10-22",
        "title": "Netflix (NFLX): Sustaining Growth with Original Content and Advertising Expansion",
        "summary": "We recently published a list of 10 Stocks with Consistent Growth to Buy. In this article, we are going to take a look at where Netflix Inc. (NASDAQ:NFLX) stands against other stocks with consistent growth to buy. Currently, financial markets are experiencing a mix of optimism and caution as investors react to changing economic conditions. […]",
        "first_p": "It doesn't matter your age or experience: taking full advantage of the stock market and investing with confidence are common goals for all investors.",
        "last_p": "Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report"
    },
    "35": {
        "ticker": "NFLX",
        "date_published": "2024-10-22",
        "title": "Netflix (NFLX): Sustaining Growth with Original Content and Advertising Expansion",
        "summary": "We recently published a list of 10 Stocks with Consistent Growth to Buy. In this article, we are going to take a look at where Netflix Inc. (NASDAQ:NFLX) stands against other stocks with consistent growth to buy. Currently, financial markets are experiencing a mix of optimism and caution as investors react to changing economic conditions. […]",
        "first_p": "How much a stock's price changes over time is a significant driver for most investors. Not only can price performance impact your portfolio, but it can help you compare investment results across sectors and industries as well.",
        "last_p": "Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report"
    },
    "36": {
        "ticker": "NFLX",
        "date_published": "2024-10-22",
        "title": "Netflix (NFLX): Sustaining Growth with Original Content and Advertising Expansion",
        "summary": "We recently published a list of 10 Stocks with Consistent Growth to Buy. In this article, we are going to take a look at where Netflix Inc. (NASDAQ:NFLX) stands against other stocks with consistent growth to buy. Currently, financial markets are experiencing a mix of optimism and caution as investors react to changing economic conditions. […]",
        "first_p": "This is The Takeaway from today's Morning Brief, which you can sign up to receive in your inbox every morning along with:",
        "last_p": "Perhaps this serves as an early reminder that while growth in tech is \"expected\" to slow from its rapid pace over the past year, that doesn't mean there can't be upside surprises — or that it still can't outperform. You don't need to look beyond the past 18 months of many tech earnings reports coming in better than expected for the empirical evidence."
    },
    "37": {
        "ticker": "NFLX",
        "date_published": "2024-10-22",
        "title": "Netflix (NFLX): Sustaining Growth with Original Content and Advertising Expansion",
        "summary": "We recently published a list of 10 Stocks with Consistent Growth to Buy. In this article, we are going to take a look at where Netflix Inc. (NASDAQ:NFLX) stands against other stocks with consistent growth to buy. Currently, financial markets are experiencing a mix of optimism and caution as investors react to changing economic conditions. […]",
        "first_p": "Chicago, IL – October 22, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Visa Inc. V, Netflix, Inc. NFLX, Merck & Co., Inc. MRK and Hovnanian Enterprises, Inc. HOV.",
        "last_p": "Netflix, Inc. (NFLX) : Free Stock Analysis Report"
    },
    "38": {
        "ticker": "NFLX",
        "date_published": "2024-10-21",
        "title": "Netflix (NFLX): Sustaining Growth with Original Content and Advertising Expansion",
        "summary": "We recently published a list of 10 Stocks with Consistent Growth to Buy. In this article, we are going to take a look at where Netflix Inc. (NASDAQ:NFLX) stands against other stocks with consistent growth to buy. Currently, financial markets are experiencing a mix of optimism and caution as investors react to changing economic conditions. […]",
        "first_p": "Monday, October 21, 2024\n\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Visa Inc. (V), Netflix, Inc. (NFLX) and Merck & Co., Inc. (MRK), as well as a micro-cap stock Hovnanian Enterprises, Inc. (HOV).  The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.\n\nThese research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\n\nYou can see all of today’s research reports here >>>\n\nShares of Visa have gained +10.9% over the year-to-date period against the Zacks Financial Transaction Services industry’s gain of +16.1%. The company’s strategic acquisitions and alliances are fostering long-term growth and consistently driving its revenues. Visa, fueled by persistent increases in payments, cross-border volumes and sustained investments in technology, is witnessing significant profit growth.\n\nThe ongoing shift to digital payments is advantageous for Visa, with strong domestic volumes supporting its overall performance. A robust cash position enables the company to enhance shareholder value. However, elevated operating expenses pose margin challenges.\n\nThe Zacks analyst expect adjusted operating expenses to jump more than 10% in fiscal 2024. It is witnessing a volatile cash volume from the Asia Pacific and CEMEA regions. Consumer spending growth is also drying up. Moreover, rising client incentives will affect its adjusted revenues. As such, the stock warrants a cautious stance.\n\n(You can read the full research report on Visa here >>>)\n\nNetflix’s shares have outperformed the Zacks Broadcast Radio and Television industry over the year-to-date period (+74.1% vs. +32.8%). The company’s third-quarter 2024 results benefited from its growing subscriber base, thanks to a robust localized and foreign-language content portfolio and healthy engagement levels with about two hours of viewing per member per day, indicating strong member retention.\n\nThe planned launch of an in-house ad tech platform in 2025 signals Netflix's commitment to maximizing this new revenue stream, with ad revenues expected to roughly double year-over-year in 2025. Netflix has raised its guidance for the full year 2024, projecting revenue growth at the high end of its previous 14-15% range.\n\nHowever, stiff competition in the streaming space from the likes of Apple, Amazon Prime Video and Disney+ is a headwind. NFLX’s leveraged balance sheet and a higher streaming obligation are concerns.\n\n(You can read the full research report on Netflix here >>>)\n\nShares of Merck have gained +0.1% over the year-to-date period against the Zacks Large Cap Pharmaceuticals industry’s gain of +22.7%. The company’s products like Keytruda and Gardasil have been driving sales. With continued label expansion into new indications, particularly earlier-stage launches, Keytruda is expected to see continued growth. Animal health and vaccine products are core growth drivers.\n\nMerck boasts a strong cancer pipeline, including Keytruda. However, generic competition for several drugs and rising competitive pressure, mainly on the diabetes franchise, will continue to be overhangs on the top line.\n\nThere are concerns about Merck’s ability to grow its non-oncology business ahead of Keytruda’s loss of exclusivity later in the decade. Estimates have declined slightly ahead of Q3 results. Merck has a positive record of earnings surprises in recent quarters.\n\n(You can read the full research report on Merck here >>>)\n\nHovnanian’s shares have outperformed the Zacks Building Products - Home Builders industry over the past year (+175.6% vs. +89.3%). This microcap company with market capitalization of $1.25 billion has shown strong financial performance in fiscal third-quarter 2024, with an 11% revenue increase to $722.7 million, driven by higher home deliveries and sales prices.\n\nThe company saw a 38% rise in income before taxes and a 30.8% rise in net income, supported by improved EBITDA of $127.9 million. Key growth drivers include a 24% increase in community count and a 34% rise in lots controlled, setting the stage for future revenue gains. Favorable mortgage rate declines and strong buyer demand, evidenced by a 23% increase in contracts and surging web traffic, support the company’s outlook.\n\nHovnanian’s strategic focus on high-margin markets and diversified geographic and product mix enhances its resilience and profitability. With upward revisions to 2024 revenue and EBITDA guidance, HOV remains well-poised for continued growth in a strong housing market.\n\n(You can read the full research report on Hovnanian here >>>)\n\nOther noteworthy reports we are featuring today include Abbott Laboratories (ABT), Blackstone Inc. (BX) and Palo Alto Networks, Inc. (PANW).\n\nMark Vickery\nSenior Editor\n\nNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>",
        "last_p": "Hovnanian Enterprises Inc (HOV) : Free Stock Analysis Report"
    },
    "39": {
        "ticker": "NFLX",
        "date_published": "2024-10-21",
        "title": "Netflix (NFLX): Sustaining Growth with Original Content and Advertising Expansion",
        "summary": "We recently published a list of 10 Stocks with Consistent Growth to Buy. In this article, we are going to take a look at where Netflix Inc. (NASDAQ:NFLX) stands against other stocks with consistent growth to buy. Currently, financial markets are experiencing a mix of optimism and caution as investors react to changing economic conditions. […]",
        "first_p": "Netflix (NFLX) stock closed at a record high just above $772 on Monday as the streamer continued to ride positive momentum from its better-than-expected quarterly results last week.",
        "last_p": "Ultimately, though, Ranganathan said it's hard to see others catching up: \"Netflix has won the streaming wars, undoubtedly.\""
    },
    "40": {
        "ticker": "NFLX",
        "date_published": "2024-10-21",
        "title": "Netflix (NFLX): Sustaining Growth with Original Content and Advertising Expansion",
        "summary": "We recently published a list of 10 Stocks with Consistent Growth to Buy. In this article, we are going to take a look at where Netflix Inc. (NASDAQ:NFLX) stands against other stocks with consistent growth to buy. Currently, financial markets are experiencing a mix of optimism and caution as investors react to changing economic conditions. […]",
        "first_p": "Netflix NFLX has once again proven its mettle in the streaming wars, delivering a stellar third-quarter 2024 performance that cements its position as the industry leader. The company's impressive earnings beat and raised guidance make it a compelling case for investors looking to capitalize on the growing digital entertainment market.\n\nIn a knockout quarter, Netflix reported earnings of $5.40 per share, surpassing the Zacks Consensus Estimate by 6.09% and posting a remarkable 44.8% year-over-year increase. This exceptional growth in profitability underscores Netflix's ability to efficiently monetize its vast content library and growing subscriber base. Revenues also impressed, reaching $9.82 billion, marking a robust 15% year-over-year increase and beating the consensus mark by 0.6%.\n\nInvestors have responded enthusiastically to Netflix's performance, with NFLX shares returning an impressive 56.9% year to date, significantly outperforming tech giants like Apple AAPL, Amazon AMZN and Disney DIS, as well as the broader Consumer Discretionary sector.",
        "last_p": "Netflix, Inc. (NFLX) : Free Stock Analysis Report"
    },
    "41": {
        "ticker": "NVDA",
        "date_published": "2024-10-24",
        "title": "Nvidia stock 'undervalued' compared to Big Tech peers: BofA",
        "summary": "Chip giant Nvidia (NVDA), despite reaching an all-time high for its stock price earlier this week, is still \"undervalued\" against its Big Tech peers, according to Bank of America analyst Vivek Arya. BofA's analyst team raised its price target on Nvidia from $165 to $190 per share, Arya citing Nvidia's position at the forefront of the \"generational opportunity\" that lies ahead. This upward revision comes as Nvidia prepares to release its third quarter earnings results on November 19, 2024. Yahoo Finance anchor Julie Hyman breaks compares Nvidia's PEG ratio (price/earnings-to-growth) to that of other Magnificent Seven tech names and Broadcom (AVGO) in today's Chart of the Day. Watch Bank of America's Vivek Arya talk more about his stock call on Nvidia with Yahoo Finance executive editor Brian Sozzi on this morning's Opening Bid. To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend here. This post was written by Kevin Hall.",
        "first_p": "(Bloomberg) -- SK Hynix Inc. posted record quarterly profit and revenue, reflecting strong demand for the memory chips used with Nvidia Corp. processors for artificial intelligence development.",
        "last_p": "Who Thinks China’s Not an Economic Powerhouse? China"
    },
    "42": {
        "ticker": "NVDA",
        "date_published": "2024-10-23",
        "title": "Nvidia stock 'undervalued' compared to Big Tech peers: BofA",
        "summary": "Chip giant Nvidia (NVDA), despite reaching an all-time high for its stock price earlier this week, is still \"undervalued\" against its Big Tech peers, according to Bank of America analyst Vivek Arya. BofA's analyst team raised its price target on Nvidia from $165 to $190 per share, Arya citing Nvidia's position at the forefront of the \"generational opportunity\" that lies ahead. This upward revision comes as Nvidia prepares to release its third quarter earnings results on November 19, 2024. Yahoo Finance anchor Julie Hyman breaks compares Nvidia's PEG ratio (price/earnings-to-growth) to that of other Magnificent Seven tech names and Broadcom (AVGO) in today's Chart of the Day. Watch Bank of America's Vivek Arya talk more about his stock call on Nvidia with Yahoo Finance executive editor Brian Sozzi on this morning's Opening Bid. To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend here. This post was written by Kevin Hall.",
        "first_p": "Investing.com-- South Korea’s SK Hynix Inc (KS:000660) on Thursday clocked a stronger-than-expected third-quarter profit as the memory chip giant saw strong sales of its advanced chips for use in artificial intelligence applications.",
        "last_p": "Related Articles"
    },
    "43": {
        "ticker": "NVDA",
        "date_published": "2024-10-23",
        "title": "Nvidia stock 'undervalued' compared to Big Tech peers: BofA",
        "summary": "Chip giant Nvidia (NVDA), despite reaching an all-time high for its stock price earlier this week, is still \"undervalued\" against its Big Tech peers, according to Bank of America analyst Vivek Arya. BofA's analyst team raised its price target on Nvidia from $165 to $190 per share, Arya citing Nvidia's position at the forefront of the \"generational opportunity\" that lies ahead. This upward revision comes as Nvidia prepares to release its third quarter earnings results on November 19, 2024. Yahoo Finance anchor Julie Hyman breaks compares Nvidia's PEG ratio (price/earnings-to-growth) to that of other Magnificent Seven tech names and Broadcom (AVGO) in today's Chart of the Day. Watch Bank of America's Vivek Arya talk more about his stock call on Nvidia with Yahoo Finance executive editor Brian Sozzi on this morning's Opening Bid. To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend here. This post was written by Kevin Hall.",
        "first_p": "SEOUL (Reuters) -South Korea's SK Hynix on Thursday posted a record quarterly profit as the Nvidia supplier saw strong sales of its advanced chips such as high bandwidth memory (HBM) ones used in generative AI chipsets.",
        "last_p": "Last month, SK Hynix, the main supplier of HBM chips to Nvidia, said it had started mass production of HBM3E 12-layer chips and plans to supply the latest products to unidentified customers by the end of this year."
    },
    "44": {
        "ticker": "NVDA",
        "date_published": "2024-10-23",
        "title": "Nvidia stock 'undervalued' compared to Big Tech peers: BofA",
        "summary": "Chip giant Nvidia (NVDA), despite reaching an all-time high for its stock price earlier this week, is still \"undervalued\" against its Big Tech peers, according to Bank of America analyst Vivek Arya. BofA's analyst team raised its price target on Nvidia from $165 to $190 per share, Arya citing Nvidia's position at the forefront of the \"generational opportunity\" that lies ahead. This upward revision comes as Nvidia prepares to release its third quarter earnings results on November 19, 2024. Yahoo Finance anchor Julie Hyman breaks compares Nvidia's PEG ratio (price/earnings-to-growth) to that of other Magnificent Seven tech names and Broadcom (AVGO) in today's Chart of the Day. Watch Bank of America's Vivek Arya talk more about his stock call on Nvidia with Yahoo Finance executive editor Brian Sozzi on this morning's Opening Bid. To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend here. This post was written by Kevin Hall.",
        "first_p": "Nvidia (NVDA, Financials) CEO Jensen Huang revealed that thanks to Taiwan Semiconductor Manufacturing Company (TSM, Financials), a design fault in its Blackwell AI chipswhich affected productionhas been fixed.",
        "last_p": "\"We had a design flaw in Blackwell,\" Huang reportedly told Reuters. \"It was functional, but the design flaw caused the yield to be low. It was 100% Nvidia's fault,\" he noted. Media sources claimed that tensions between Nvidia and TSMC had resulted from manufacturing delays; nonetheless, Huang dismissed such claims as \"fake news.\""
    },
    "45": {
        "ticker": "NVDA",
        "date_published": "2024-10-23",
        "title": "Nvidia stock 'undervalued' compared to Big Tech peers: BofA",
        "summary": "Chip giant Nvidia (NVDA), despite reaching an all-time high for its stock price earlier this week, is still \"undervalued\" against its Big Tech peers, according to Bank of America analyst Vivek Arya. BofA's analyst team raised its price target on Nvidia from $165 to $190 per share, Arya citing Nvidia's position at the forefront of the \"generational opportunity\" that lies ahead. This upward revision comes as Nvidia prepares to release its third quarter earnings results on November 19, 2024. Yahoo Finance anchor Julie Hyman breaks compares Nvidia's PEG ratio (price/earnings-to-growth) to that of other Magnificent Seven tech names and Broadcom (AVGO) in today's Chart of the Day. Watch Bank of America's Vivek Arya talk more about his stock call on Nvidia with Yahoo Finance executive editor Brian Sozzi on this morning's Opening Bid. To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend here. This post was written by Kevin Hall.",
        "first_p": "We recently looked at Goldman Sachs’ List Of Stocks That Hedge & Mutual Funds Love & Hate: 28 Stocks On The Mutual and Hedge Funds Radar. In this piece, we will look at where NVIDIA Corporation (NASDAQ:NVDA) sits on the fund managers' radar.",
        "last_p": "Baron Funds mentioned NVIDIA Corporation (NASDAQ:NVDA) in its Q2 2024 investor letter. Here is what the firm said:"
    },
    "46": {
        "ticker": "NVDA",
        "date_published": "2024-10-23",
        "title": "Nvidia stock 'undervalued' compared to Big Tech peers: BofA",
        "summary": "Chip giant Nvidia (NVDA), despite reaching an all-time high for its stock price earlier this week, is still \"undervalued\" against its Big Tech peers, according to Bank of America analyst Vivek Arya. BofA's analyst team raised its price target on Nvidia from $165 to $190 per share, Arya citing Nvidia's position at the forefront of the \"generational opportunity\" that lies ahead. This upward revision comes as Nvidia prepares to release its third quarter earnings results on November 19, 2024. Yahoo Finance anchor Julie Hyman breaks compares Nvidia's PEG ratio (price/earnings-to-growth) to that of other Magnificent Seven tech names and Broadcom (AVGO) in today's Chart of the Day. Watch Bank of America's Vivek Arya talk more about his stock call on Nvidia with Yahoo Finance executive editor Brian Sozzi on this morning's Opening Bid. To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend here. This post was written by Kevin Hall.",
        "first_p": "By Nora Eckert and David Shepardson",
        "last_p": "Danny Shapiro, head of chipmaker Nvidia's automotive division, said he recognizes in China a willingness to invest in enabling greater software power in its vehicles. He said Detroit, by contrast, often seems to have the mindset: \"What’s the cheapest thing I can put in to get by?\""
    },
    "47": {
        "ticker": "NVDA",
        "date_published": "2024-10-23",
        "title": "Nvidia stock 'undervalued' compared to Big Tech peers: BofA",
        "summary": "Chip giant Nvidia (NVDA), despite reaching an all-time high for its stock price earlier this week, is still \"undervalued\" against its Big Tech peers, according to Bank of America analyst Vivek Arya. BofA's analyst team raised its price target on Nvidia from $165 to $190 per share, Arya citing Nvidia's position at the forefront of the \"generational opportunity\" that lies ahead. This upward revision comes as Nvidia prepares to release its third quarter earnings results on November 19, 2024. Yahoo Finance anchor Julie Hyman breaks compares Nvidia's PEG ratio (price/earnings-to-growth) to that of other Magnificent Seven tech names and Broadcom (AVGO) in today's Chart of the Day. Watch Bank of America's Vivek Arya talk more about his stock call on Nvidia with Yahoo Finance executive editor Brian Sozzi on this morning's Opening Bid. To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend here. This post was written by Kevin Hall.",
        "first_p": "Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.",
        "last_p": "Check It Out:"
    },
    "48": {
        "ticker": "NVDA",
        "date_published": "2024-10-23",
        "title": "Nvidia stock 'undervalued' compared to Big Tech peers: BofA",
        "summary": "Chip giant Nvidia (NVDA), despite reaching an all-time high for its stock price earlier this week, is still \"undervalued\" against its Big Tech peers, according to Bank of America analyst Vivek Arya. BofA's analyst team raised its price target on Nvidia from $165 to $190 per share, Arya citing Nvidia's position at the forefront of the \"generational opportunity\" that lies ahead. This upward revision comes as Nvidia prepares to release its third quarter earnings results on November 19, 2024. Yahoo Finance anchor Julie Hyman breaks compares Nvidia's PEG ratio (price/earnings-to-growth) to that of other Magnificent Seven tech names and Broadcom (AVGO) in today's Chart of the Day. Watch Bank of America's Vivek Arya talk more about his stock call on Nvidia with Yahoo Finance executive editor Brian Sozzi on this morning's Opening Bid. To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend here. This post was written by Kevin Hall.",
        "first_p": "Recently, the beloved Nvidia NVDA has hit fresh all-time highs. As we know, stocks making new highs tend to make even higher highs, particularly when a company’s earnings outlook remains positive.",
        "last_p": "Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report"
    },
    "49": {
        "ticker": "NVDA",
        "date_published": "2024-10-23",
        "title": "Nvidia stock 'undervalued' compared to Big Tech peers: BofA",
        "summary": "Chip giant Nvidia (NVDA), despite reaching an all-time high for its stock price earlier this week, is still \"undervalued\" against its Big Tech peers, according to Bank of America analyst Vivek Arya. BofA's analyst team raised its price target on Nvidia from $165 to $190 per share, Arya citing Nvidia's position at the forefront of the \"generational opportunity\" that lies ahead. This upward revision comes as Nvidia prepares to release its third quarter earnings results on November 19, 2024. Yahoo Finance anchor Julie Hyman breaks compares Nvidia's PEG ratio (price/earnings-to-growth) to that of other Magnificent Seven tech names and Broadcom (AVGO) in today's Chart of the Day. Watch Bank of America's Vivek Arya talk more about his stock call on Nvidia with Yahoo Finance executive editor Brian Sozzi on this morning's Opening Bid. To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend here. This post was written by Kevin Hall.",
        "first_p": "The third-quarter earnings season is underway, and the so-called “Magnificent 7\" or “Mag 7” companies are in focus again. These stock market darlings of the first half of 2024 lost their steam in recent months due to the fading AI craze and investors' love for the sectors benefiting the most from rate cuts.\n\nThe seven stocks comprising “Mag 7” are Tesla TSLA, Alphabet GOOGL, Meta Platforms META, Microsoft MSFT, Apple AAPL, Amazon AMZN and NVIDIA NVDA. Among the seven, Tesla will be the first to report, with its earnings release scheduled after market close today. Alphabet is scheduled to report on Oct. 29, followed by Microsoft and Meta Platforms on Oct. 30, and Apple and Amazon on Oct. 31. NVIDIA is likely to report next month.\n\nThird-quarter earnings of the “Mag 7” companies are expected to be up 16.2% from the same period last year on 13.6% higher revenues. In the second quarter, Mag 7 recorded 35.2% earnings growth on 14.7% higher revenues.\n\nStay up-to-date with all quarterly releases:See Zacks Earnings Calendar.",
        "last_p": "Alphabet Inc. (GOOGL) : Free Stock Analysis Report"
    },
    "50": {
        "ticker": "NVDA",
        "date_published": "2024-10-23",
        "title": "Nvidia stock 'undervalued' compared to Big Tech peers: BofA",
        "summary": "Chip giant Nvidia (NVDA), despite reaching an all-time high for its stock price earlier this week, is still \"undervalued\" against its Big Tech peers, according to Bank of America analyst Vivek Arya. BofA's analyst team raised its price target on Nvidia from $165 to $190 per share, Arya citing Nvidia's position at the forefront of the \"generational opportunity\" that lies ahead. This upward revision comes as Nvidia prepares to release its third quarter earnings results on November 19, 2024. Yahoo Finance anchor Julie Hyman breaks compares Nvidia's PEG ratio (price/earnings-to-growth) to that of other Magnificent Seven tech names and Broadcom (AVGO) in today's Chart of the Day. Watch Bank of America's Vivek Arya talk more about his stock call on Nvidia with Yahoo Finance executive editor Brian Sozzi on this morning's Opening Bid. To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend here. This post was written by Kevin Hall.",
        "first_p": "NVIDIA NVDA has been on an explosive surge this year with no signs of a slowdown, fueled by the artificial intelligence (AI) frenzy. The chipmaker is on track to overtake Apple (AAPL) as the world's most valuable company, topping $3.5 trillion in market capitalization. The stock has risen 190% so far this year and is expected to rise further.\n\nMost analysts believe NVIDIA will become far more valuable in the future due to its dominance in the billion-dollar AI chip market.",
        "last_p": "AXS Esoterica NextG Economy ETF (WUGI): ETF Research Reports"
    },
    "51": {
        "ticker": "GOOG",
        "date_published": "2024-10-23",
        "title": "RBNZ Thinking About Lingering Inflation Pressures, Orr Says",
        "summary": "(Bloomberg) -- The Reserve Bank of New Zealand’s Monetary Policy Committee is still thinking about lingering price pressures, even as it cuts interest rates to reflect a lower inflation outlook, Governor Adrian Orr said.Most Read from BloombergClimate Change Is Killing Buildings in Slow MotionOman Sees an Urban Future Distinct From Dubai and Abu DhabiTransportation Policy Gets Left Behind in Presidential RaceHow Kyiv Became a Leader in Digital Services Amid Wartime StrainDhaka's Revolutionary Ma",
        "first_p": "By Brendan Pierson",
        "last_p": "The chatbot responded, \"...please do, my sweet king.\" Sewell shot himself with his stepfather's pistol \"seconds\" later, the lawsuit said."
    },
    "52": {
        "ticker": "GOOG",
        "date_published": "2024-10-23",
        "title": "RBNZ Thinking About Lingering Inflation Pressures, Orr Says",
        "summary": "(Bloomberg) -- The Reserve Bank of New Zealand’s Monetary Policy Committee is still thinking about lingering price pressures, even as it cuts interest rates to reflect a lower inflation outlook, Governor Adrian Orr said.Most Read from BloombergClimate Change Is Killing Buildings in Slow MotionOman Sees an Urban Future Distinct From Dubai and Abu DhabiTransportation Policy Gets Left Behind in Presidential RaceHow Kyiv Became a Leader in Digital Services Amid Wartime StrainDhaka's Revolutionary Ma",
        "first_p": "Through Qualcomm's Snapdragon Digital Chassis and Google's Android Automotive operating system, both Qualcomm (QCOM, Financials) and Google (GOOG, Financials) are extending their collaboration to include artificial intelligence into automobiles. On Tuesday, the firms announced the alliance at Qualcomm's Snapdragon Summit 2024 in Maui.",
        "last_p": "According to Qualcomm, the technology will enable integration with mobile devices, computers, and cloud accounts by tying automobiles to consumers' digital life. The firm says \"intuitive voice assistants, immersive map experiences, and real-time updates\" will predict driver demands."
    },
    "53": {
        "ticker": "GOOG",
        "date_published": "2024-10-23",
        "title": "RBNZ Thinking About Lingering Inflation Pressures, Orr Says",
        "summary": "(Bloomberg) -- The Reserve Bank of New Zealand’s Monetary Policy Committee is still thinking about lingering price pressures, even as it cuts interest rates to reflect a lower inflation outlook, Governor Adrian Orr said.Most Read from BloombergClimate Change Is Killing Buildings in Slow MotionOman Sees an Urban Future Distinct From Dubai and Abu DhabiTransportation Policy Gets Left Behind in Presidential RaceHow Kyiv Became a Leader in Digital Services Amid Wartime StrainDhaka's Revolutionary Ma",
        "first_p": "Artificial Intelligence has driven shares of tech companies like Microsoft (MSFT), Amazon (AMZN), Nvidia (NVDA), and Google (GOOG, GOOGL) to new highs this year. But the technology, which companies promise will revolutionize our lives, is driving something else just as high as stock prices: energy consumption.",
        "last_p": "Still, with tech companies promising an AI revolution that requires power-hungry data centers, nuclear may be the only realistic green choice until solar and wind can take over permanently."
    },
    "54": {
        "ticker": "GOOG",
        "date_published": "2024-10-23",
        "title": "RBNZ Thinking About Lingering Inflation Pressures, Orr Says",
        "summary": "(Bloomberg) -- The Reserve Bank of New Zealand’s Monetary Policy Committee is still thinking about lingering price pressures, even as it cuts interest rates to reflect a lower inflation outlook, Governor Adrian Orr said.Most Read from BloombergClimate Change Is Killing Buildings in Slow MotionOman Sees an Urban Future Distinct From Dubai and Abu DhabiTransportation Policy Gets Left Behind in Presidential RaceHow Kyiv Became a Leader in Digital Services Amid Wartime StrainDhaka's Revolutionary Ma",
        "first_p": "We recently looked at Goldman Sachs’ List Of Stocks That Hedge & Mutual Funds Love & Hate: 28 Stocks On The Mutual and Hedge Funds Radar. In this piece, we will look at where Alphabet Inc. (NASDAQ:GOOG) sits on the fund managers' radar.",
        "last_p": "Patient Capital Management mentioned Alphabet Inc. (NASDAQ:GOOG) in its Q2 2024 investor letter. Here is what the fund said:"
    },
    "55": {
        "ticker": "GOOG",
        "date_published": "2024-10-23",
        "title": "RBNZ Thinking About Lingering Inflation Pressures, Orr Says",
        "summary": "(Bloomberg) -- The Reserve Bank of New Zealand’s Monetary Policy Committee is still thinking about lingering price pressures, even as it cuts interest rates to reflect a lower inflation outlook, Governor Adrian Orr said.Most Read from BloombergClimate Change Is Killing Buildings in Slow MotionOman Sees an Urban Future Distinct From Dubai and Abu DhabiTransportation Policy Gets Left Behind in Presidential RaceHow Kyiv Became a Leader in Digital Services Amid Wartime StrainDhaka's Revolutionary Ma",
        "first_p": "(Bloomberg) -- The Reserve Bank of New Zealand’s Monetary Policy Committee is still thinking about lingering price pressures, even as it cuts interest rates to reflect a lower inflation outlook, Governor Adrian Orr said.",
        "last_p": "Who Thinks China’s Not an Economic Powerhouse? China"
    },
    "56": {
        "ticker": "GOOG",
        "date_published": "2024-10-23",
        "title": "RBNZ Thinking About Lingering Inflation Pressures, Orr Says",
        "summary": "(Bloomberg) -- The Reserve Bank of New Zealand’s Monetary Policy Committee is still thinking about lingering price pressures, even as it cuts interest rates to reflect a lower inflation outlook, Governor Adrian Orr said.Most Read from BloombergClimate Change Is Killing Buildings in Slow MotionOman Sees an Urban Future Distinct From Dubai and Abu DhabiTransportation Policy Gets Left Behind in Presidential RaceHow Kyiv Became a Leader in Digital Services Amid Wartime StrainDhaka's Revolutionary Ma",
        "first_p": "The third-quarter earnings season is underway, and the so-called “Magnificent 7\" or “Mag 7” companies are in focus again. These stock market darlings of the first half of 2024 lost their steam in recent months due to the fading AI craze and investors' love for the sectors benefiting the most from rate cuts.\n\nThe seven stocks comprising “Mag 7” are Tesla TSLA, Alphabet GOOGL, Meta Platforms META, Microsoft MSFT, Apple AAPL, Amazon AMZN and NVIDIA NVDA. Among the seven, Tesla will be the first to report, with its earnings release scheduled after market close today. Alphabet is scheduled to report on Oct. 29, followed by Microsoft and Meta Platforms on Oct. 30, and Apple and Amazon on Oct. 31. NVIDIA is likely to report next month.\n\nThird-quarter earnings of the “Mag 7” companies are expected to be up 16.2% from the same period last year on 13.6% higher revenues. In the second quarter, Mag 7 recorded 35.2% earnings growth on 14.7% higher revenues.\n\nStay up-to-date with all quarterly releases:See Zacks Earnings Calendar.",
        "last_p": "Alphabet Inc. (GOOGL) : Free Stock Analysis Report"
    },
    "57": {
        "ticker": "GOOG",
        "date_published": "2024-10-23",
        "title": "RBNZ Thinking About Lingering Inflation Pressures, Orr Says",
        "summary": "(Bloomberg) -- The Reserve Bank of New Zealand’s Monetary Policy Committee is still thinking about lingering price pressures, even as it cuts interest rates to reflect a lower inflation outlook, Governor Adrian Orr said.Most Read from BloombergClimate Change Is Killing Buildings in Slow MotionOman Sees an Urban Future Distinct From Dubai and Abu DhabiTransportation Policy Gets Left Behind in Presidential RaceHow Kyiv Became a Leader in Digital Services Amid Wartime StrainDhaka's Revolutionary Ma",
        "first_p": "Growth stocks are attractive to many investors, as above-average financial growth helps these stocks easily grab the market's attention and produce exceptional returns. But finding a growth stock that can live up to its true potential can be a tough task.",
        "last_p": "Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report"
    },
    "58": {
        "ticker": "GOOG",
        "date_published": "2024-10-23",
        "title": "RBNZ Thinking About Lingering Inflation Pressures, Orr Says",
        "summary": "(Bloomberg) -- The Reserve Bank of New Zealand’s Monetary Policy Committee is still thinking about lingering price pressures, even as it cuts interest rates to reflect a lower inflation outlook, Governor Adrian Orr said.Most Read from BloombergClimate Change Is Killing Buildings in Slow MotionOman Sees an Urban Future Distinct From Dubai and Abu DhabiTransportation Policy Gets Left Behind in Presidential RaceHow Kyiv Became a Leader in Digital Services Amid Wartime StrainDhaka's Revolutionary Ma",
        "first_p": "By Stephen Nellis",
        "last_p": "The offering's primary competition is the commercial services offered by companies such as OpenAI and Google-backed Anthropic AI."
    },
    "59": {
        "ticker": "GOOG",
        "date_published": "2024-10-23",
        "title": "RBNZ Thinking About Lingering Inflation Pressures, Orr Says",
        "summary": "(Bloomberg) -- The Reserve Bank of New Zealand’s Monetary Policy Committee is still thinking about lingering price pressures, even as it cuts interest rates to reflect a lower inflation outlook, Governor Adrian Orr said.Most Read from BloombergClimate Change Is Killing Buildings in Slow MotionOman Sees an Urban Future Distinct From Dubai and Abu DhabiTransportation Policy Gets Left Behind in Presidential RaceHow Kyiv Became a Leader in Digital Services Amid Wartime StrainDhaka's Revolutionary Ma",
        "first_p": "The third-quarter earnings season is underway, and the so-called “Magnificent 7\" companies are in focus. The “Mag 7,” the stock market darlings in the first half of 2024, lost their steam in recent months due to the fading AI craze and investors' love for the sectors benefiting the most from rate cuts.\n\nThe seven stocks are Apple (AAPL), Microsoft (MSFT), Alphabet (GOOG, GOOGL), Amazon (AMZN), NVIDIA (NVDA), Tesla (TSLA) and Meta Platforms (META). Among the seven, Tesla will be the first to report, with the release scheduled after market close today. Alphabet is scheduled to report on Oct. 29, followed by Microsoft and Meta Platforms on Oct. 30, and Apple and Amazon on Oct. 31. NVIDIA is likely to report next month.\n\nThe third-quarter earnings for the “Mag 7” companies are expected to be up 16.2% from the same period last year on 13.6% higher revenues. This would follow the 35.2% earnings growth on 14.7% higher revenues in the second quarter.\n\nStay up-to-date with all quarterly releases:See Zacks Earnings Calendar.\n\nTesla\n\nTesla has an Earnings ESP of -1.28% and a Zacks Rank #2 (Buy). According to our methodology, the combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 or 3 (Hold) increases the chances of an earnings beat. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.\n\nThe electric carmaker saw no earnings estimate revision over the past 30 days for the to-be-reported quarter. The Zacks Consensus Estimate for third-quarter earnings indicates a substantial year-over-year decline of 12.1% and revenue growth of 9.5%. The earnings track record of the company is not good as it delivered a four-quarter average negative earnings surprise of 7.99%. The electric carmaker is down 5.7% in the last three months (read: Should You Buy Tesla ETFs Ahead of Q3 Earnings?).\n\nTesla returned to delivery growth in the third quarter after two consecutive quarters of decline and reported the third-largest quarterly number in the company's history. Investors are keenly waiting for specifics on the company's plans for an affordable EV below $30,000 and its long-term Cybercab vision after the recent Robotaxi event, which left investors disappointed due to the lack of concrete details regarding its ridesharing platform.\n\nAlphabet\n\nAlphabet has an Earnings ESP of +1.57% and Zacks Rank #2. It saw no earnings estimate revision over the past 30 days for the to-be-reported quarter. The company’s earnings surprise track record over the past four quarters is good, with the average being 9.60%. Earnings are expected to increase 18.1%, while revenues are expected to grow 13.6% from the year-ago quarter. The Internet behemoth has plunged 9% in the last three months.\n\nGoogle is facing headwinds from antitrust lawsuits and intensifying competition in the AI space. Analysts are concerned about the impact of generative AI on Google's core search business.\n\nMeta Platforms\n\nMeta Platforms has an Earnings ESP of +2.83% and Zacks Rank #2. The social media giant saw a positive earnings estimate revision of 2 cents for the to-be-reported quarter over the past 30 days. Analysts increasing estimates right before earnings — with the most up-to-date information possible — is a good indicator for the stock. The Zacks Consensus Estimate for the yet-to-be-reported quarter indicates substantial year-over-year earnings growth of 17.8%. Revenues are expected to increase 17.6% year over year. Meta Platforms delivered an earnings surprise of 12.61%, on average, in the last four quarters. Shares of META have gained about 23.5% over the past three months.\n\nMeta Platform is trading near an all-time high and several analysts raised the target price for META ahead of its earnings, showing strong confidence in the company’s growth. UBS raised the price target to $690 from $635, maintaining a Buy rating, while Guggenheim raised Meta's price target to $665 from $600 with a Buy rating. Jefferies and TD Cowen lifted the price target on Meta Platforms to $675 from $600 each and kept a Buy rating. KeyBanc increased the price target to $655 from the previous $560 while maintaining an Overweight rating on the stock.\n\nAnalysts cited enhanced user engagement and better monetization of video content, including the Reels feature on the platform. An increased ad load and overall usage rate for its Reels (short-form-video) offering would \"continue to drive growth\" for Instagram.\n\nMicrosoft\n\nMicrosoft has an Earnings ESP of -0.74% and a Zacks Rank #3. Microsoft saw a positive earnings estimate revision of a penny over the past 30 days for the to-be-reported quarter. Its earnings track record is impressive, with the four-quarter earnings surprise being 6.34%, on average. The Zacks Consensus Estimate indicates earnings growth of 3% and revenue growth of 14% from the year-ago quarter. Microsoft has shed about 4% over the past three months.\n\nThe world's largest software company is spending billions to construct new data centers to meet demand for cloud computing and power-hungry AI services. While Azure growth will continue to slow in the current quarter, chief financial officer Amy Hood said that investments in data centers and servers will let the company capitalize on demand and accelerate Azure growth in the second half of fiscal 2025. Microsoft expects revenues of $63.8-$64.8 billion for the first quarter of fiscal 2025, implying 13.8% growth at the middle of the range.\n\nApple\n\nApple has an Earnings ESP of -17.71% and a Zacks Rank #3. Apple saw a negative earnings estimate revision of 6 cents over the past 30 days for the fiscal fourth quarter. The iPhone maker has a strong track record of positive earnings surprises. It delivered an average earnings surprise of 3.79% in the trailing four quarters. The Zacks Consensus Estimate indicates a modest year-over-year increase of 5.5% for earnings and 5.6% for revenues. The stock is up 4.9% over the past three months.\n\nThe iPhone manufacturer returned to revenue growth in fiscal third-quarter 2024 and introduced four versions of iPhone 16 based on AI last month. The new AI-based iPhones will likely kickstart the next big upgrade cycle, enhancing the company's performance and restoring investor confidence in Apple. The stock touched a new high this week on improving demand for its latest iPhone 16. The preliminary iPhone shipment data posted by International Data Corporation showed strong demand for Apple's previous smartphone models. Sales were also helped by Apple's rollout of iPhone 16 (read: ETFs to Tap Apple's Potential AI-Based Growth).\n\nAmazon\n\nAmazon has an Earnings ESP of 0.00% and a Zacks Rank #3. The stock saw no earnings estimate revision over the past 30 days for the third quarter. The Zacks Consensus Estimate indicates a year-over-year earnings increase of 34.1% and substantial revenue growth of 9.8% for the to-be-reported quarter. Additionally, Amazon’s earnings surprise history is impressive, with the four-quarter average surprise being 31.1%. The stock has gained about 1.8% in the past three months.\n\nAmazon remains the king of e-commerce, and its advertising unit is booming. The growth in Amazon’s cloud computing business — Amazon Web Services (“AWS”) — is also accelerating, driven by its AI capabilities. Like other tech companies, Amazon has been ramping up investments in data centers, chips and the power needed for AI workloads. The world's largest online retailer expects revenues in the range of $154-$158.5 billion for the third quarter of 2024.",
        "last_p": "iShares S&P 100 ETF (OEF): ETF Research Reports"
    },
    "60": {
        "ticker": "GOOG",
        "date_published": "2024-10-23",
        "title": "RBNZ Thinking About Lingering Inflation Pressures, Orr Says",
        "summary": "(Bloomberg) -- The Reserve Bank of New Zealand’s Monetary Policy Committee is still thinking about lingering price pressures, even as it cuts interest rates to reflect a lower inflation outlook, Governor Adrian Orr said.Most Read from BloombergClimate Change Is Killing Buildings in Slow MotionOman Sees an Urban Future Distinct From Dubai and Abu DhabiTransportation Policy Gets Left Behind in Presidential RaceHow Kyiv Became a Leader in Digital Services Amid Wartime StrainDhaka's Revolutionary Ma",
        "first_p": "Wall Street expects a year-over-year increase in earnings on higher revenues when DoorDash, Inc. (DASH) reports results for the quarter ended September 2024. While this widely-known consensus outlook is important in gauging the company's earnings picture, a powerful factor that could impact its near-term stock price is how the actual results compare to these estimates.",
        "last_p": "DoorDash, Inc. (DASH) : Free Stock Analysis Report"
    },
    "61": {
        "ticker": "GOOG",
        "date_published": "2024-10-23",
        "title": "RBNZ Thinking About Lingering Inflation Pressures, Orr Says",
        "summary": "(Bloomberg) -- The Reserve Bank of New Zealand’s Monetary Policy Committee is still thinking about lingering price pressures, even as it cuts interest rates to reflect a lower inflation outlook, Governor Adrian Orr said.Most Read from BloombergClimate Change Is Killing Buildings in Slow MotionOman Sees an Urban Future Distinct From Dubai and Abu DhabiTransportation Policy Gets Left Behind in Presidential RaceHow Kyiv Became a Leader in Digital Services Amid Wartime StrainDhaka's Revolutionary Ma",
        "first_p": "When deciding whether to buy, sell, or hold a stock, investors often rely on analyst recommendations. Media reports about rating changes by these brokerage-firm-employed (or sell-side) analysts often influence a stock's price, but are they really important?",
        "last_p": "Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report"
    },
    "62": {
        "ticker": "GOOG",
        "date_published": "2024-10-23",
        "title": "RBNZ Thinking About Lingering Inflation Pressures, Orr Says",
        "summary": "(Bloomberg) -- The Reserve Bank of New Zealand’s Monetary Policy Committee is still thinking about lingering price pressures, even as it cuts interest rates to reflect a lower inflation outlook, Governor Adrian Orr said.Most Read from BloombergClimate Change Is Killing Buildings in Slow MotionOman Sees an Urban Future Distinct From Dubai and Abu DhabiTransportation Policy Gets Left Behind in Presidential RaceHow Kyiv Became a Leader in Digital Services Amid Wartime StrainDhaka's Revolutionary Ma",
        "first_p": "Qualcomm (QCOM) and Google (GOOG, GOOGL) are betting you want artificial intelligence in your car. But what does that mean exactly?",
        "last_p": "“You know, this platform is deployed across hundreds of millions of vehicles today. So I can bet you if you're driving a car today that you bought in the last couple of years, it's featuring our technology,” Duggal said, meaning if it’s already compatible with CarPlay, it should stay that way."
    },
    "63": {
        "ticker": "GOOG",
        "date_published": "2024-10-23",
        "title": "RBNZ Thinking About Lingering Inflation Pressures, Orr Says",
        "summary": "(Bloomberg) -- The Reserve Bank of New Zealand’s Monetary Policy Committee is still thinking about lingering price pressures, even as it cuts interest rates to reflect a lower inflation outlook, Governor Adrian Orr said.Most Read from BloombergClimate Change Is Killing Buildings in Slow MotionOman Sees an Urban Future Distinct From Dubai and Abu DhabiTransportation Policy Gets Left Behind in Presidential RaceHow Kyiv Became a Leader in Digital Services Amid Wartime StrainDhaka's Revolutionary Ma",
        "first_p": "Alphabet (GOOGL) has been one of the most searched-for stocks on Zacks.com lately. So, you might want to look at some of the facts that could shape the stock's performance in the near term.",
        "last_p": "Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report"
    },
    "64": {
        "ticker": "GOOG",
        "date_published": "2024-10-23",
        "title": "RBNZ Thinking About Lingering Inflation Pressures, Orr Says",
        "summary": "(Bloomberg) -- The Reserve Bank of New Zealand’s Monetary Policy Committee is still thinking about lingering price pressures, even as it cuts interest rates to reflect a lower inflation outlook, Governor Adrian Orr said.Most Read from BloombergClimate Change Is Killing Buildings in Slow MotionOman Sees an Urban Future Distinct From Dubai and Abu DhabiTransportation Policy Gets Left Behind in Presidential RaceHow Kyiv Became a Leader in Digital Services Amid Wartime StrainDhaka's Revolutionary Ma",
        "first_p": "We recently published a list of 10 Stocks with Consistent Growth to Buy. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOG) stands against other stocks with consistent growth to buy.",
        "last_p": "These achievements and strategic initiatives make GOOG a compelling stock for investors looking for long-term growth potential. Analysts are bullish on Alphabet Inc. (NASDAQ:GOOG) and the 12-month median price target set by analysts indicates a potential upside of 24% from the current stock price."
    },
    "65": {
        "ticker": "GOOG",
        "date_published": "2024-10-23",
        "title": "RBNZ Thinking About Lingering Inflation Pressures, Orr Says",
        "summary": "(Bloomberg) -- The Reserve Bank of New Zealand’s Monetary Policy Committee is still thinking about lingering price pressures, even as it cuts interest rates to reflect a lower inflation outlook, Governor Adrian Orr said.Most Read from BloombergClimate Change Is Killing Buildings in Slow MotionOman Sees an Urban Future Distinct From Dubai and Abu DhabiTransportation Policy Gets Left Behind in Presidential RaceHow Kyiv Became a Leader in Digital Services Amid Wartime StrainDhaka's Revolutionary Ma",
        "first_p": "This is The Takeaway from today's Morning Brief, which you can sign up to receive in your inbox every morning along with:",
        "last_p": "Even if that $206 billion in investment — set to be $235 billion next year — is expensive, there are two big potential macro benefits on the table."
    },
    "66": {
        "ticker": "MSFT",
        "date_published": "2024-10-23",
        "title": "What You Should Know About \"Magnificent 7\" Stocks Ahead of Earnings",
        "summary": "Among the seven companies, Tesla is going to be the first to report, with its earnings release scheduled after market close today.",
        "first_p": "Artificial Intelligence has driven shares of tech companies like Microsoft (MSFT), Amazon (AMZN), Nvidia (NVDA), and Google (GOOG, GOOGL) to new highs this year. But the technology, which companies promise will revolutionize our lives, is driving something else just as high as stock prices: energy consumption.",
        "last_p": "Still, with tech companies promising an AI revolution that requires power-hungry data centers, nuclear may be the only realistic green choice until solar and wind can take over permanently."
    },
    "67": {
        "ticker": "MSFT",
        "date_published": "2024-10-23",
        "title": "What You Should Know About \"Magnificent 7\" Stocks Ahead of Earnings",
        "summary": "Among the seven companies, Tesla is going to be the first to report, with its earnings release scheduled after market close today.",
        "first_p": "We recently looked at Goldman Sachs’ List Of Stocks That Hedge & Mutual Funds Love & Hate: 28 Stocks On The Mutual and Hedge Funds Radar. In this piece, we will look at where Microsoft Corporation (NASDAQ:MSFT) sits on the fund managers' radar.",
        "last_p": "Baron Funds mentioned Microsoft Corporation (NASDAQ:MSFT) in its Q2 2024 investor letter. Here is what the firm said:"
    },
    "68": {
        "ticker": "MSFT",
        "date_published": "2024-10-23",
        "title": "What You Should Know About \"Magnificent 7\" Stocks Ahead of Earnings",
        "summary": "Among the seven companies, Tesla is going to be the first to report, with its earnings release scheduled after market close today.",
        "first_p": "The third-quarter earnings season is underway, and the so-called “Magnificent 7\" or “Mag 7” companies are in focus again. These stock market darlings of the first half of 2024 lost their steam in recent months due to the fading AI craze and investors' love for the sectors benefiting the most from rate cuts.\n\nThe seven stocks comprising “Mag 7” are Tesla TSLA, Alphabet GOOGL, Meta Platforms META, Microsoft MSFT, Apple AAPL, Amazon AMZN and NVIDIA NVDA. Among the seven, Tesla will be the first to report, with its earnings release scheduled after market close today. Alphabet is scheduled to report on Oct. 29, followed by Microsoft and Meta Platforms on Oct. 30, and Apple and Amazon on Oct. 31. NVIDIA is likely to report next month.\n\nThird-quarter earnings of the “Mag 7” companies are expected to be up 16.2% from the same period last year on 13.6% higher revenues. In the second quarter, Mag 7 recorded 35.2% earnings growth on 14.7% higher revenues.\n\nStay up-to-date with all quarterly releases:See Zacks Earnings Calendar.",
        "last_p": "Alphabet Inc. (GOOGL) : Free Stock Analysis Report"
    },
    "69": {
        "ticker": "MSFT",
        "date_published": "2024-10-23",
        "title": "What You Should Know About \"Magnificent 7\" Stocks Ahead of Earnings",
        "summary": "Among the seven companies, Tesla is going to be the first to report, with its earnings release scheduled after market close today.",
        "first_p": "NEW YORK (AP) — Foreign adversaries have shown continued determination to influence the U.S. election –- and there are signs their activity will intensify as Election Day nears, Microsoft said in a report Wednesday.",
        "last_p": "If they tried, improvements to election security means there is no way they could alter the results, Jen Easterly, director of the U.S. Cybersecurity and Infrastructure Security Agency, told The Associated Press earlier this month."
    },
    "70": {
        "ticker": "MSFT",
        "date_published": "2024-10-23",
        "title": "What You Should Know About \"Magnificent 7\" Stocks Ahead of Earnings",
        "summary": "Among the seven companies, Tesla is going to be the first to report, with its earnings release scheduled after market close today.",
        "first_p": "By Christopher Bing and A.J. Vicens",
        "last_p": "The group also released a video on social media, purporting to come from activist hackers, where they showed them probing an election system. While that operation never affected individual voting systems, the goal was to cause chaos, confusion and doubt, senior U.S. officials said at the time."
    },
    "71": {
        "ticker": "MSFT",
        "date_published": "2024-10-23",
        "title": "What You Should Know About \"Magnificent 7\" Stocks Ahead of Earnings",
        "summary": "Among the seven companies, Tesla is going to be the first to report, with its earnings release scheduled after market close today.",
        "first_p": "By Christopher Bing and A.J. Vicens",
        "last_p": "Rubio said in a statement that he believed China's goal was to \"shape American opinion on critical issues and target specific candidates, especially those they view as anti-China.\""
    },
    "72": {
        "ticker": "MSFT",
        "date_published": "2024-10-23",
        "title": "What You Should Know About \"Magnificent 7\" Stocks Ahead of Earnings",
        "summary": "Among the seven companies, Tesla is going to be the first to report, with its earnings release scheduled after market close today.",
        "first_p": "Taking a huge step towards the future of work, Microsoft (MSFT, Financial) is soon set to debut its artificial intelligence employees in the next month, making an apparently epoch-making change for its business model and MSFT stock. These AI agents, these software instruments that could help various organizations with tasks like supply chain coordination or answering customer questions, are some of the earliest ways by which these recent advances in artificial intelligence technology have been implemented.",
        "last_p": "Fortunately for Microsoft, in the fast-moving tech space, the company has always been ahead of the game in responding and bringing more changes. In this generative AI, Microsoft has been on the frontline to deploy and advance new technologies like OpenAI's ChatGPT to boost its cloud services while at the same time increasing its market portfolio."
    },
    "73": {
        "ticker": "MSFT",
        "date_published": "2024-10-23",
        "title": "What You Should Know About \"Magnificent 7\" Stocks Ahead of Earnings",
        "summary": "Among the seven companies, Tesla is going to be the first to report, with its earnings release scheduled after market close today.",
        "first_p": "The third-quarter earnings season is underway, and the so-called “Magnificent 7\" companies are in focus. The “Mag 7,” the stock market darlings in the first half of 2024, lost their steam in recent months due to the fading AI craze and investors' love for the sectors benefiting the most from rate cuts.\n\nThe seven stocks are Apple (AAPL), Microsoft (MSFT), Alphabet (GOOG, GOOGL), Amazon (AMZN), NVIDIA (NVDA), Tesla (TSLA) and Meta Platforms (META). Among the seven, Tesla will be the first to report, with the release scheduled after market close today. Alphabet is scheduled to report on Oct. 29, followed by Microsoft and Meta Platforms on Oct. 30, and Apple and Amazon on Oct. 31. NVIDIA is likely to report next month.\n\nThe third-quarter earnings for the “Mag 7” companies are expected to be up 16.2% from the same period last year on 13.6% higher revenues. This would follow the 35.2% earnings growth on 14.7% higher revenues in the second quarter.\n\nStay up-to-date with all quarterly releases:See Zacks Earnings Calendar.\n\nTesla\n\nTesla has an Earnings ESP of -1.28% and a Zacks Rank #2 (Buy). According to our methodology, the combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 or 3 (Hold) increases the chances of an earnings beat. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.\n\nThe electric carmaker saw no earnings estimate revision over the past 30 days for the to-be-reported quarter. The Zacks Consensus Estimate for third-quarter earnings indicates a substantial year-over-year decline of 12.1% and revenue growth of 9.5%. The earnings track record of the company is not good as it delivered a four-quarter average negative earnings surprise of 7.99%. The electric carmaker is down 5.7% in the last three months (read: Should You Buy Tesla ETFs Ahead of Q3 Earnings?).\n\nTesla returned to delivery growth in the third quarter after two consecutive quarters of decline and reported the third-largest quarterly number in the company's history. Investors are keenly waiting for specifics on the company's plans for an affordable EV below $30,000 and its long-term Cybercab vision after the recent Robotaxi event, which left investors disappointed due to the lack of concrete details regarding its ridesharing platform.\n\nAlphabet\n\nAlphabet has an Earnings ESP of +1.57% and Zacks Rank #2. It saw no earnings estimate revision over the past 30 days for the to-be-reported quarter. The company’s earnings surprise track record over the past four quarters is good, with the average being 9.60%. Earnings are expected to increase 18.1%, while revenues are expected to grow 13.6% from the year-ago quarter. The Internet behemoth has plunged 9% in the last three months.\n\nGoogle is facing headwinds from antitrust lawsuits and intensifying competition in the AI space. Analysts are concerned about the impact of generative AI on Google's core search business.\n\nMeta Platforms\n\nMeta Platforms has an Earnings ESP of +2.83% and Zacks Rank #2. The social media giant saw a positive earnings estimate revision of 2 cents for the to-be-reported quarter over the past 30 days. Analysts increasing estimates right before earnings — with the most up-to-date information possible — is a good indicator for the stock. The Zacks Consensus Estimate for the yet-to-be-reported quarter indicates substantial year-over-year earnings growth of 17.8%. Revenues are expected to increase 17.6% year over year. Meta Platforms delivered an earnings surprise of 12.61%, on average, in the last four quarters. Shares of META have gained about 23.5% over the past three months.\n\nMeta Platform is trading near an all-time high and several analysts raised the target price for META ahead of its earnings, showing strong confidence in the company’s growth. UBS raised the price target to $690 from $635, maintaining a Buy rating, while Guggenheim raised Meta's price target to $665 from $600 with a Buy rating. Jefferies and TD Cowen lifted the price target on Meta Platforms to $675 from $600 each and kept a Buy rating. KeyBanc increased the price target to $655 from the previous $560 while maintaining an Overweight rating on the stock.\n\nAnalysts cited enhanced user engagement and better monetization of video content, including the Reels feature on the platform. An increased ad load and overall usage rate for its Reels (short-form-video) offering would \"continue to drive growth\" for Instagram.\n\nMicrosoft\n\nMicrosoft has an Earnings ESP of -0.74% and a Zacks Rank #3. Microsoft saw a positive earnings estimate revision of a penny over the past 30 days for the to-be-reported quarter. Its earnings track record is impressive, with the four-quarter earnings surprise being 6.34%, on average. The Zacks Consensus Estimate indicates earnings growth of 3% and revenue growth of 14% from the year-ago quarter. Microsoft has shed about 4% over the past three months.\n\nThe world's largest software company is spending billions to construct new data centers to meet demand for cloud computing and power-hungry AI services. While Azure growth will continue to slow in the current quarter, chief financial officer Amy Hood said that investments in data centers and servers will let the company capitalize on demand and accelerate Azure growth in the second half of fiscal 2025. Microsoft expects revenues of $63.8-$64.8 billion for the first quarter of fiscal 2025, implying 13.8% growth at the middle of the range.\n\nApple\n\nApple has an Earnings ESP of -17.71% and a Zacks Rank #3. Apple saw a negative earnings estimate revision of 6 cents over the past 30 days for the fiscal fourth quarter. The iPhone maker has a strong track record of positive earnings surprises. It delivered an average earnings surprise of 3.79% in the trailing four quarters. The Zacks Consensus Estimate indicates a modest year-over-year increase of 5.5% for earnings and 5.6% for revenues. The stock is up 4.9% over the past three months.\n\nThe iPhone manufacturer returned to revenue growth in fiscal third-quarter 2024 and introduced four versions of iPhone 16 based on AI last month. The new AI-based iPhones will likely kickstart the next big upgrade cycle, enhancing the company's performance and restoring investor confidence in Apple. The stock touched a new high this week on improving demand for its latest iPhone 16. The preliminary iPhone shipment data posted by International Data Corporation showed strong demand for Apple's previous smartphone models. Sales were also helped by Apple's rollout of iPhone 16 (read: ETFs to Tap Apple's Potential AI-Based Growth).\n\nAmazon\n\nAmazon has an Earnings ESP of 0.00% and a Zacks Rank #3. The stock saw no earnings estimate revision over the past 30 days for the third quarter. The Zacks Consensus Estimate indicates a year-over-year earnings increase of 34.1% and substantial revenue growth of 9.8% for the to-be-reported quarter. Additionally, Amazon’s earnings surprise history is impressive, with the four-quarter average surprise being 31.1%. The stock has gained about 1.8% in the past three months.\n\nAmazon remains the king of e-commerce, and its advertising unit is booming. The growth in Amazon’s cloud computing business — Amazon Web Services (“AWS”) — is also accelerating, driven by its AI capabilities. Like other tech companies, Amazon has been ramping up investments in data centers, chips and the power needed for AI workloads. The world's largest online retailer expects revenues in the range of $154-$158.5 billion for the third quarter of 2024.",
        "last_p": "iShares S&P 100 ETF (OEF): ETF Research Reports"
    },
    "74": {
        "ticker": "MSFT",
        "date_published": "2024-10-23",
        "title": "What You Should Know About \"Magnificent 7\" Stocks Ahead of Earnings",
        "summary": "Among the seven companies, Tesla is going to be the first to report, with its earnings release scheduled after market close today.",
        "first_p": "Loop Capital has reiterated its Buy rating on Microsoft Corporation (MSFT, Financial),which has a super-super-strong buy of $500, as we expect Microsoft to have great Q1 numbers for growth in cloud services and AI. With the slight improvement in IT expenses, growth was most noticeable in the third quarter, which fared better than the preceding quarters in the year. The firm is optimistic that spending will gain momentum up to and including the final quarter.",
        "last_p": "Moreover, Loop Capital's focus was on increasing market awareness of the Microsoft analytics platform Fabric and shaking up the data lake and analytics market. As for Microsoft's more conventional Windows business, AI-fueled PCs are anticipated to trigger a refresh cycle. Though the remainder of our growth is expected in 2025, we have moved up the expectations of a significant part of our growth from the second half of 2024."
    },
    "75": {
        "ticker": "MSFT",
        "date_published": "2024-10-23",
        "title": "What You Should Know About \"Magnificent 7\" Stocks Ahead of Earnings",
        "summary": "Among the seven companies, Tesla is going to be the first to report, with its earnings release scheduled after market close today.",
        "first_p": "Microsoft (MSFT) is expected to deliver a year-over-year increase in earnings on higher revenues when it reports results for the quarter ended September 2024. This widely-known consensus outlook gives a good sense of the company's earnings picture, but how the actual results compare to these estimates is a powerful factor that could impact its near-term stock price.",
        "last_p": "Microsoft Corporation (MSFT) : Free Stock Analysis Report"
    },
    "76": {
        "ticker": "MSFT",
        "date_published": "2024-10-23",
        "title": "What You Should Know About \"Magnificent 7\" Stocks Ahead of Earnings",
        "summary": "Among the seven companies, Tesla is going to be the first to report, with its earnings release scheduled after market close today.",
        "first_p": "We recently published a list of 10 Stocks with Consistent Growth to Buy. In this article, we are going to take a look at where Microsoft Corporation (NASDAQ:MSFT) stands against other stocks with consistent growth to buy.",
        "last_p": "As of the second quarter of 2024, MSFT was held by 279 hedge funds, according to Insider Monkey’s database. Mar Vista Investment Partners, LLC stated the following regarding Microsoft Corporation (NASDAQ:MSFT) in its “Mar Vista Focus strategy” Q2 2024 investor letter:"
    },
    "77": {
        "ticker": "MSFT",
        "date_published": "2024-10-23",
        "title": "What You Should Know About \"Magnificent 7\" Stocks Ahead of Earnings",
        "summary": "Among the seven companies, Tesla is going to be the first to report, with its earnings release scheduled after market close today.",
        "first_p": "Microsoft Corporation (NASDAQ:MSFT) will increase its dividend from last year's comparable payment on the 12th of December to $0.83. The payment will take the dividend yield to 0.8%, which is in line with the average for the industry.",
        "last_p": "Investors could be attracted to the stock based on the quality of its payment history. Microsoft has impressed us by growing EPS at 18% per year over the past five years. Growth in EPS bodes well for the dividend, as does the low payout ratio that the company is currently reporting."
    },
    "78": {
        "ticker": "MSFT",
        "date_published": "2024-10-23",
        "title": "What You Should Know About \"Magnificent 7\" Stocks Ahead of Earnings",
        "summary": "Among the seven companies, Tesla is going to be the first to report, with its earnings release scheduled after market close today.",
        "first_p": "WARREN, N.J., Oct. 23, 2024 (GLOBE NEWSWIRE) -- Tevogen Bio (“Tevogen” or “Tevogen Bio Holdings Inc.”) (Nasdaq: TVGN), a clinical-stage specialty immunotherapy biotech developing off-the-shelf, genetically unmodified T cell therapeutics to treat infectious disease and cancers, announces its Artificial Intelligence effort, Tevogen AI, has joined Microsoft (Nasdaq: MSFT) for Startups. This partnership marks a significant milestone for Tevogen, providing unparalleled access to Microsoft’s extensive ecosystem. The partnership is set to accelerate and streamline the development of Tevogen’s proprietary algorithms, significantly advancing our mission to lower the total cost of drug development, expedite drug discovery, and deliver life-changing therapies to large patient populations.",
        "last_p": "You should not place undue reliance on forward-looking statements, which speak only as of the date they are made. Tevogen undertakes no obligation to update any forward-looking statements, except as required by applicable law."
    },
    "79": {
        "ticker": "CRWD",
        "date_published": "2024-10-23",
        "title": "Jim Cramer Says CrowdStrike Holdings, Inc. (CRWD) ‘Is A High Flyer That Sells For 85 Times Earnings’",
        "summary": "We recently compiled a list of the Jim Cramer on Taiwan Semiconductor, Netflix, and Other Stocks. In this article, we are going to take a look at where CrowdStrike Holdings, Inc. (NASDAQ:CRWD) stands against the other stocks on Jim Cramer’s list. Jim Cramer, the host of Mad Money, recently expressed concern that some investors are overlooking […]",
        "first_p": "AI-native cybersecurity and digital work platform integration delivers real-time threat detection and automated remediation to natively secure virtual and physical environments; optimizes work experience and productivity",
        "last_p": "View source version on businesswire.com: https://www.businesswire.com/news/home/20241023972733/en/"
    },
    "80": {
        "ticker": "CRWD",
        "date_published": "2024-10-23",
        "title": "Jim Cramer Says CrowdStrike Holdings, Inc. (CRWD) ‘Is A High Flyer That Sells For 85 Times Earnings’",
        "summary": "We recently compiled a list of the Jim Cramer on Taiwan Semiconductor, Netflix, and Other Stocks. In this article, we are going to take a look at where CrowdStrike Holdings, Inc. (NASDAQ:CRWD) stands against the other stocks on Jim Cramer’s list. Jim Cramer, the host of Mad Money, recently expressed concern that some investors are overlooking […]",
        "first_p": "As of October 2024, the U.S. stock market is experiencing mixed performances amid a wave of earnings reports, with the Nasdaq Composite rising for its fifth consecutive session while the Dow Jones Industrial Average and S&P 500 see slight declines. In this environment, identifying stocks that may be priced below their intrinsic value can offer potential opportunities for investors seeking to navigate these fluctuating market conditions effectively.",
        "last_p": "Fuel your portfolio with companies showing strong growth potential, backed by optimistic outlooks both from analysts and management."
    },
    "81": {
        "ticker": "CRWD",
        "date_published": "2024-10-22",
        "title": "Jim Cramer Says CrowdStrike Holdings, Inc. (CRWD) ‘Is A High Flyer That Sells For 85 Times Earnings’",
        "summary": "We recently compiled a list of the Jim Cramer on Taiwan Semiconductor, Netflix, and Other Stocks. In this article, we are going to take a look at where CrowdStrike Holdings, Inc. (NASDAQ:CRWD) stands against the other stocks on Jim Cramer’s list. Jim Cramer, the host of Mad Money, recently expressed concern that some investors are overlooking […]",
        "first_p": "CrowdStrike Holdings (CRWD) ended the recent trading session at $308.51, demonstrating a -0.34% swing from the preceding day's closing price. This change lagged the S&P 500's daily loss of 0.05%. Meanwhile, the Dow lost 0.02%, and the Nasdaq, a tech-heavy index, added 0.18%.",
        "last_p": "Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report"
    },
    "82": {
        "ticker": "CRWD",
        "date_published": "2024-10-22",
        "title": "Jim Cramer Says CrowdStrike Holdings, Inc. (CRWD) ‘Is A High Flyer That Sells For 85 Times Earnings’",
        "summary": "We recently compiled a list of the Jim Cramer on Taiwan Semiconductor, Netflix, and Other Stocks. In this article, we are going to take a look at where CrowdStrike Holdings, Inc. (NASDAQ:CRWD) stands against the other stocks on Jim Cramer’s list. Jim Cramer, the host of Mad Money, recently expressed concern that some investors are overlooking […]",
        "first_p": "To unite their AI-native endpoint security with next-generation firewall protection, CrowdStrike (CRWD, Financials) formed a strategic agreement with Fortinet (FTNT, Financials). Combining CrowdStrike's Falcon cybersecurity technology with Fortinet's FortiGate firewalls helps this alliance enhance consumer protection across networks, applications, and endpoints.",
        "last_p": "Recently, CrowdStrike has been rapidly expanding its offerings. One clear shift is their Falcon Next-Gen SIEM (Security Information and Event Management) technology, which they presented at Fal.Con 2024, their primary user conference. Security operations centers may use this new platform to improve response times, speed up threat detection, and simplify operations. It aggregates artificial intelligence-powered tools, most notably CrowdStrike Charlotte AI, which facilitates incident investigation and rapid response actions."
    },
    "83": {
        "ticker": "CRWD",
        "date_published": "2024-10-22",
        "title": "Jim Cramer Says CrowdStrike Holdings, Inc. (CRWD) ‘Is A High Flyer That Sells For 85 Times Earnings’",
        "summary": "We recently compiled a list of the Jim Cramer on Taiwan Semiconductor, Netflix, and Other Stocks. In this article, we are going to take a look at where CrowdStrike Holdings, Inc. (NASDAQ:CRWD) stands against the other stocks on Jim Cramer’s list. Jim Cramer, the host of Mad Money, recently expressed concern that some investors are overlooking […]",
        "first_p": "Strategic partnership unifies AI-native endpoint security and next-generation firewall protection to secure organizations across networks, applications and endpoints",
        "last_p": "View source version on businesswire.com: https://www.businesswire.com/news/home/20241022948981/en/"
    },
    "84": {
        "ticker": "CRWD",
        "date_published": "2024-10-20",
        "title": "Jim Cramer Says CrowdStrike Holdings, Inc. (CRWD) ‘Is A High Flyer That Sells For 85 Times Earnings’",
        "summary": "We recently compiled a list of the Jim Cramer on Taiwan Semiconductor, Netflix, and Other Stocks. In this article, we are going to take a look at where CrowdStrike Holdings, Inc. (NASDAQ:CRWD) stands against the other stocks on Jim Cramer’s list. Jim Cramer, the host of Mad Money, recently expressed concern that some investors are overlooking […]",
        "first_p": "We recently compiled a list of the Jim Cramer on Taiwan Semiconductor, Netflix, and Other Stocks. In this article, we are going to take a look at where CrowdStrike Holdings, Inc. (NASDAQ:CRWD) stands against the other stocks on Jim Cramer's list.",
        "last_p": ""
    },
    "85": {
        "ticker": "CRWD",
        "date_published": "2024-10-20",
        "title": "Jim Cramer Says CrowdStrike Holdings, Inc. (CRWD) ‘Is A High Flyer That Sells For 85 Times Earnings’",
        "summary": "We recently compiled a list of the Jim Cramer on Taiwan Semiconductor, Netflix, and Other Stocks. In this article, we are going to take a look at where CrowdStrike Holdings, Inc. (NASDAQ:CRWD) stands against the other stocks on Jim Cramer’s list. Jim Cramer, the host of Mad Money, recently expressed concern that some investors are overlooking […]",
        "first_p": "We recently compiled a list of the 10 Most Promising Tech Stocks According to Hedge Funds. In this article, we are going to take a look at where CrowdStrike Holdings, Inc. (NASDAQ:CRWD) stands against the other promising tech stocks.",
        "last_p": "Overall CRWD ranks 10th on our list of the most promising tech stocks according to hedge funds. While we acknowledge the potential of CRWD as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter time frame. If you are looking for an AI stock that is more promising than CRWD but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock."
    },
    "86": {
        "ticker": "CRWD",
        "date_published": "2024-10-18",
        "title": "Jim Cramer Says CrowdStrike Holdings, Inc. (CRWD) ‘Is A High Flyer That Sells For 85 Times Earnings’",
        "summary": "We recently compiled a list of the Jim Cramer on Taiwan Semiconductor, Netflix, and Other Stocks. In this article, we are going to take a look at where CrowdStrike Holdings, Inc. (NASDAQ:CRWD) stands against the other stocks on Jim Cramer’s list. Jim Cramer, the host of Mad Money, recently expressed concern that some investors are overlooking […]",
        "first_p": "CrowdStrike Holdings (CRWD) is one of the stocks most watched by Zacks.com visitors lately. So, it might be a good idea to review some of the factors that might affect the near-term performance of the stock.",
        "last_p": "Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report"
    },
    "87": {
        "ticker": "CRWD",
        "date_published": "2024-10-16",
        "title": "Jim Cramer Says CrowdStrike Holdings, Inc. (CRWD) ‘Is A High Flyer That Sells For 85 Times Earnings’",
        "summary": "We recently compiled a list of the Jim Cramer on Taiwan Semiconductor, Netflix, and Other Stocks. In this article, we are going to take a look at where CrowdStrike Holdings, Inc. (NASDAQ:CRWD) stands against the other stocks on Jim Cramer’s list. Jim Cramer, the host of Mad Money, recently expressed concern that some investors are overlooking […]",
        "first_p": "Tague brings nearly three decades of cybersecurity and IT leadership experience to new role as VP of sales for ANZ; will drive growth and accelerate adoption of AI-native Falcon platform to meet regional cybersecurity requirements",
        "last_p": "© 2024 CrowdStrike, Inc. All rights reserved. CrowdStrike, the falcon logo, CrowdStrike Falcon and CrowdStrike Threat Graph are marks owned by CrowdStrike, Inc. and registered with the United States Patent and Trademark Office, and in other countries. CrowdStrike owns other trademarks and service marks, and may use the brands of third parties to identify their products and services."
    },
    "88": {
        "ticker": "CRWD",
        "date_published": "2024-10-16",
        "title": "Jim Cramer Says CrowdStrike Holdings, Inc. (CRWD) ‘Is A High Flyer That Sells For 85 Times Earnings’",
        "summary": "We recently compiled a list of the Jim Cramer on Taiwan Semiconductor, Netflix, and Other Stocks. In this article, we are going to take a look at where CrowdStrike Holdings, Inc. (NASDAQ:CRWD) stands against the other stocks on Jim Cramer’s list. Jim Cramer, the host of Mad Money, recently expressed concern that some investors are overlooking […]",
        "first_p": "The most recent trading session ended with CrowdStrike Holdings (CRWD) standing at $306.24, reflecting a +1.3% shift from the previouse trading day's closing. The stock's performance was ahead of the S&P 500's daily gain of 0.47%. Elsewhere, the Dow gained 0.79%, while the tech-heavy Nasdaq added 0.28%.",
        "last_p": "Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report"
    },
    "89": {
        "ticker": "CRWD",
        "date_published": "2024-10-16",
        "title": "Jim Cramer Says CrowdStrike Holdings, Inc. (CRWD) ‘Is A High Flyer That Sells For 85 Times Earnings’",
        "summary": "We recently compiled a list of the Jim Cramer on Taiwan Semiconductor, Netflix, and Other Stocks. In this article, we are going to take a look at where CrowdStrike Holdings, Inc. (NASDAQ:CRWD) stands against the other stocks on Jim Cramer’s list. Jim Cramer, the host of Mad Money, recently expressed concern that some investors are overlooking […]",
        "first_p": "Over the last 7 days, the United States market has risen by 1.1% and is up 32% over the past year, with earnings forecasted to grow by 15% annually. In this environment of robust growth, identifying high growth tech stocks involves looking for companies that demonstrate strong innovation potential and scalability to capitalize on these favorable market conditions.",
        "last_p": "Find companies with promising cash flow potential yet trading below their fair value."
    },
    "90": {
        "ticker": "CRWD",
        "date_published": "2024-10-14",
        "title": "Jim Cramer Says CrowdStrike Holdings, Inc. (CRWD) ‘Is A High Flyer That Sells For 85 Times Earnings’",
        "summary": "We recently compiled a list of the Jim Cramer on Taiwan Semiconductor, Netflix, and Other Stocks. In this article, we are going to take a look at where CrowdStrike Holdings, Inc. (NASDAQ:CRWD) stands against the other stocks on Jim Cramer’s list. Jim Cramer, the host of Mad Money, recently expressed concern that some investors are overlooking […]",
        "first_p": "We recently published a list of 10 Best Stocks to Buy and Hold For The Next Decade.  In this article, we are going to take a look at where CrowdStrike Holdings, Inc. (NASDAQ:CRWD) stands against the other best stocks to buy and hold for the next decade.",
        "last_p": "Analysts are bullish on CRWD and their 12-month median price target of $325 points to an 11% upside from current levels. According to the Insider Monkey database, CRWD was held by 69 hedge funds at the close of Q2 2024 with total stakes amounting to $3.01 billion."
    },
    "91": {
        "ticker": "CRWD",
        "date_published": "2024-10-14",
        "title": "Jim Cramer Says CrowdStrike Holdings, Inc. (CRWD) ‘Is A High Flyer That Sells For 85 Times Earnings’",
        "summary": "We recently compiled a list of the Jim Cramer on Taiwan Semiconductor, Netflix, and Other Stocks. In this article, we are going to take a look at where CrowdStrike Holdings, Inc. (NASDAQ:CRWD) stands against the other stocks on Jim Cramer’s list. Jim Cramer, the host of Mad Money, recently expressed concern that some investors are overlooking […]",
        "first_p": "Investing.com -- Shares of SentinelOne (NYSE:S) jumped 5% in pre-open trade on Monday following an upgrade by analysts at Piper Sandler, who revised their rating on the stock to “overweight” from “neutral.”",
        "last_p": "Related Articles"
    },
    "92": {
        "ticker": "AVGO",
        "date_published": "2024-10-23",
        "title": "AI Leaders Broadcom And SentinelOne Lead 5 Stocks Near Buy Points",
        "summary": "The top stocks to watch tap several hot trends: artificial intelligence, natural foods, robotic surgeries and podcasts.",
        "first_p": "We recently published a list of 10 Stocks with Consistent Growth to Buy. In this article, we are going to take a look at where Broadcom Inc. (NASDAQ:AVGO) stands against other stocks with consistent growth to buy.",
        "last_p": "According to Insider Monkey’s Q2 2024 database of over 900 hedge funds, 130 hedge funds held stakes in Broadcom Inc. (NASDAQ:AVGO). ClearBridge Investments stated the following regarding Broadcom Inc. (NASDAQ:AVGO) in its “ClearBridge Large Cap Value Strategy” Q3 2024 investor letter:"
    },
    "93": {
        "ticker": "AVGO",
        "date_published": "2024-10-23",
        "title": "AI Leaders Broadcom And SentinelOne Lead 5 Stocks Near Buy Points",
        "summary": "The top stocks to watch tap several hot trends: artificial intelligence, natural foods, robotic surgeries and podcasts.",
        "first_p": "Chicago, IL – October 23, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: NVIDIA Corp. NVDA, Microsoft Corp. MSFT, Broadcom Inc. AVGO and Comstock Holding Companies, Inc. CHCI.",
        "last_p": "Broadcom Inc. (AVGO) : Free Stock Analysis Report"
    },
    "94": {
        "ticker": "AVGO",
        "date_published": "2024-10-22",
        "title": "AI Leaders Broadcom And SentinelOne Lead 5 Stocks Near Buy Points",
        "summary": "The top stocks to watch tap several hot trends: artificial intelligence, natural foods, robotic surgeries and podcasts.",
        "first_p": "Tuesday, October 22, 2024\n\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including NVIDIA Corp. (NVDA), Microsoft Corp. (MSFT) and Broadcom Inc. (AVGO), as well as a micro-cap stocks Comstock Holding Companies, Inc. (CHCI). The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.\n\nThese research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\n\nYou can see all of today’s research reports here >>>\n\nNVIDIA’s shares have outperformed the Zacks Semiconductor - General industry over the year-to-date period (+190.3% vs. +135.4%). The company is benefiting from the strong growth of artificial intelligence (AI), high performance and accelerated computing. The data center end-market business is benefiting from the growing demand for generative AI and large language models using graphic processing units (GPUs) based on NVIDIA Hopper and Ampere architectures.\n\nA surge in hyperscale demand and higher sell-ins to partners across the Gaming and ProViz end markets following the normalization of channel inventory are acting as tailwinds. Collaborations with Mercedes-Benz and Audi are likely to advance its presence in the autonomous vehicles and other automotive electronics space.\n\nThe Zacks analyst expect NVIDIA’s revenues to witness a CAGR of 46.4% through fiscal 2025-2027. However, softening IT spending amid macroeconomic headwinds and the US-China tech war remain major concerns.\n\n(You can read the full research report on NVIDIA here >>>)\n\nShares of Microsoft have gained +11.9% over the year-to-date period against the Zacks Computer - Software industry’s gain of +13.3%. The company is riding on strong growth from Intelligent Cloud and Productivity and Business Processes. Intelligent Cloud revenues are driven by growth in Azure and other cloud services.\n\nProductivity and Business Processes revenues continue to rise due to the strong adoption of Office 365 Commercial solutions. Microsoft 365 Consumer subscribers grew to 80.8 million in the third quarter. Continued momentum in the small and medium businesses and frontline worker offerings, as well as a rise in revenue per user, drove top-line growth. The Zacks analyst expect fiscal 2025 net sales to grow 12.8% from fiscal 2024.\n\nHowever, the office's declining commercial licensing has been a headwind due to the continued customer shift to cloud offerings. Higher operating expenses and spending on Azure enhancements amid stiff competition in the cloud space remain a concern.\n\n(You can read the full research report on Microsoft here >>>)\n\nBroadcom’s shares have outperformed the Zacks Electronics - Semiconductors industry over the year-to-date period (+63.0% vs. +44.3%). The company is benefiting from strong demand for its networking products. In second-quarter 2024, it witnessed strong demand for custom AI accelerators, AI networking solutions, Ethernet switching, optical lasers, thin dies, PCI Express switches and Network Interface Cards from hyperscale customers.\n\nBroadcom’s solutions are suitable for addressing the needs of an increasing AI workload and the growing need for fast networking in data centers. The acquisition of VMware has benefited Infrastructure software solutions. Its expanding clientele, which includes the likes of Alphabet and Meta Platforms, is noteworthy.\n\nAVGO’s strong partner base, including Arista Networks, Dell Technologies, Juniper and Supermicro, has been a key catalyst. AI revenues are now expected to be $12 billion for fiscal 2024.\n\n(You can read the full research report on Broadcom here >>>)\n\nShares of Comstock have outperformed the Zacks Building Products - Home Builders industry over the year-to-date period (+143.9% vs. +26.8%). This microcap company with market capitalization of $106.61 million recorded strong revenue growth of 11% year over year, reaching $21.4 million in the first half of 2024.\n\nThis growth is driven by high demand for its premium, transit-oriented properties like The Hartford and Reston Metro Plaza, with fully leased spaces attracting high-profile tenants such as Google, Rolls-Royce, and GuidePoint Security. The company’s focus on urban, commuter-friendly developments positions it well to capture long-term growth in the Washington D.C. market.\n\nComstock's asset-light, debt-free model, combined with access to a $10 million credit facility, provides ample financial flexibility for future developments. Its diversified tenant base and strong occupancy rates reduce vacancy risk. However, the company faces concentration risk with heavy reliance on key developments. A structural shift toward remote work also poses challenges to its office leasing performance.\n\n(You can read the full research report on Comstock here >>>)\n\nOther noteworthy reports we are featuring today include Roche Holding AG (RHHBY), American Express Co. (AXP) and The Progressive Corp. (PGR).\n\nMark Vickery\nSenior Editor\n\nNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>",
        "last_p": "Broadcom Inc. (AVGO) : Free Stock Analysis Report"
    },
    "95": {
        "ticker": "AVGO",
        "date_published": "2024-10-22",
        "title": "AI Leaders Broadcom And SentinelOne Lead 5 Stocks Near Buy Points",
        "summary": "The top stocks to watch tap several hot trends: artificial intelligence, natural foods, robotic surgeries and podcasts.",
        "first_p": "PALO ALTO, Calif., Oct. 22, 2024 (GLOBE NEWSWIRE) -- Broadcom Inc. (NASDAQ: AVGO),\nwhich recently acquired VMware\n, is hosting VMware Explore 2024 Barcelona November 4-7 at the Fira Gran Via, featuring a variety of breakout sessions, certification training, and labs spanning relevant technology and industry topics.",
        "last_p": "To learn more about VMware Explore, please visit:\nhttps://www.vmware.com/explore.html"
    },
    "96": {
        "ticker": "AVGO",
        "date_published": "2024-10-21",
        "title": "AI Leaders Broadcom And SentinelOne Lead 5 Stocks Near Buy Points",
        "summary": "The top stocks to watch tap several hot trends: artificial intelligence, natural foods, robotic surgeries and podcasts.",
        "first_p": "In the latest market close, Broadcom Inc. (AVGO) reached $179.99, with a +0.06% movement compared to the previous day. This change outpaced the S&P 500's 0.18% loss on the day. Meanwhile, the Dow lost 0.8%, and the Nasdaq, a tech-heavy index, added 0.27%.",
        "last_p": "Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report"
    },
    "97": {
        "ticker": "AVGO",
        "date_published": "2024-10-21",
        "title": "AI Leaders Broadcom And SentinelOne Lead 5 Stocks Near Buy Points",
        "summary": "The top stocks to watch tap several hot trends: artificial intelligence, natural foods, robotic surgeries and podcasts.",
        "first_p": "We recently published a list of Insiders are Selling These 10 AI Stocks. Since Broadcom Inc (NASDAQ:AVGO) ranks 8th on the list, it deserves a deeper look.",
        "last_p": "Columbia Threadneedle Global Technology Growth Strategy stated the following regarding Broadcom Inc. (NASDAQ:AVGO) in its Q2 2024 investor letter:"
    },
    "98": {
        "ticker": "AVGO",
        "date_published": "2024-10-21",
        "title": "AI Leaders Broadcom And SentinelOne Lead 5 Stocks Near Buy Points",
        "summary": "The top stocks to watch tap several hot trends: artificial intelligence, natural foods, robotic surgeries and podcasts.",
        "first_p": "Chicago, IL – October 21, 2024 – Zacks Market Edge is a podcast hosted weekly by Zacks Stock Strategist Tracey Ryniec. Every week, Tracey will be joined by guests to discuss the hottest investing topics in stocks, bonds and ETFs and how it impacts your life. To listen to the podcast, click here:  https://www.zacks.com/stock/news/2353381/should-you-buy-semiconductor-stocks-right-now",
        "last_p": "Broadcom Inc. (AVGO) : Free Stock Analysis Report"
    },
    "99": {
        "ticker": "AVGO",
        "date_published": "2024-10-20",
        "title": "AI Leaders Broadcom And SentinelOne Lead 5 Stocks Near Buy Points",
        "summary": "The top stocks to watch tap several hot trends: artificial intelligence, natural foods, robotic surgeries and podcasts.",
        "first_p": "We recently compiled a list of the 10 Most Profitable Stocks of the Last 10 Years. In this article, we are going to take a look at where Broadcom (NASDAQ:AVGO) stands against the other profitable stocks.",
        "last_p": ""
    },
    "100": {
        "ticker": "AVGO",
        "date_published": "2024-10-20",
        "title": "AI Leaders Broadcom And SentinelOne Lead 5 Stocks Near Buy Points",
        "summary": "The top stocks to watch tap several hot trends: artificial intelligence, natural foods, robotic surgeries and podcasts.",
        "first_p": "We recently compiled a list of the 10 Best Internet of Things (IoT) Stocks to Buy. In this article, we are going to take a look at where Broadcom Inc. (NASDAQ:AVGO) stands against the other IoT stocks.",
        "last_p": ""
    },
    "101": {
        "ticker": "AVGO",
        "date_published": "2024-10-20",
        "title": "AI Leaders Broadcom And SentinelOne Lead 5 Stocks Near Buy Points",
        "summary": "The top stocks to watch tap several hot trends: artificial intelligence, natural foods, robotic surgeries and podcasts.",
        "first_p": "We recently compiled a list of the 10 Most Promising Tech Stocks According to Hedge Funds. In this article, we are going to take a look at where Broadcom Inc. (NASDAQ:AVGO) stands against the other promising tech stocks.",
        "last_p": ""
    },
    "102": {
        "ticker": "AVGO",
        "date_published": "2024-10-19",
        "title": "AI Leaders Broadcom And SentinelOne Lead 5 Stocks Near Buy Points",
        "summary": "The top stocks to watch tap several hot trends: artificial intelligence, natural foods, robotic surgeries and podcasts.",
        "first_p": "We recently compiled a list of the 8 Stocks with Lowest Short Interest to Buy. In this article, we are going to take a look at where Broadcom Inc. (NASDAQ:AVGO) stands against the other stocks with lowest short interest to buy.",
        "last_p": "Overall AVGO ranks 8th on our list of the stocks with lowest short interest to buy. While we acknowledge the potential of AVGO as an investment, our conviction lies in the belief that some deeply undervalued AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for a deeply undervalued AI stock that is more promising than AVGO but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock."
    },
    "103": {
        "ticker": "AVGO",
        "date_published": "2024-10-19",
        "title": "AI Leaders Broadcom And SentinelOne Lead 5 Stocks Near Buy Points",
        "summary": "The top stocks to watch tap several hot trends: artificial intelligence, natural foods, robotic surgeries and podcasts.",
        "first_p": "We recently compiled a list of the 20 Trending AI Stocks on Latest News and Ratings. In this article, we are going to take a look at where Broadcom Inc. (NASDAQ:AVGO) stands against the other trending AI stocks.",
        "last_p": ""
    },
    "104": {
        "ticker": "AVGO",
        "date_published": "2024-10-19",
        "title": "AI Leaders Broadcom And SentinelOne Lead 5 Stocks Near Buy Points",
        "summary": "The top stocks to watch tap several hot trends: artificial intelligence, natural foods, robotic surgeries and podcasts.",
        "first_p": "Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.",
        "last_p": "Lower interest rates mean some investments won't yield what they did in months past, but you don't have to lose those gains. Certain private market real estate investments are giving retail investors the opportunity to capitalize on these high-yield opportunities."
    },
    "105": {
        "ticker": "AVGO",
        "date_published": "2024-10-19",
        "title": "AI Leaders Broadcom And SentinelOne Lead 5 Stocks Near Buy Points",
        "summary": "The top stocks to watch tap several hot trends: artificial intelligence, natural foods, robotic surgeries and podcasts.",
        "first_p": "We recently looked at Goldman Sachs’ Stocks With Highest Consensus Returns: 42 Stocks With The Highest Consensus ROE. In this piece, we will look at where Broadcom Inc. (NASDAQ:AVGO) ranks in the list.",
        "last_p": "Baron Funds mentioned Broadcom Inc. (NASDAQ:AVGO) in its Q2 2024 investor letter. Here is what the firm said:"
    },
    "106": {
        "ticker": "NOW",
        "date_published": "2024-10-23",
        "title": "ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems for net-new innovation, digital growth and scale",
        "summary": "SANTA CLARA, Calif., October 23, 2024--ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems",
        "first_p": "(Bloomberg) -- ServiceNow Inc. reported strong third-quarter sales and bookings, but failed to clear the lofty expectations of investors looking for a bigger boost from artificial intelligence.",
        "last_p": "Who Thinks China’s Not an Economic Powerhouse? China"
    },
    "107": {
        "ticker": "NOW",
        "date_published": "2024-10-23",
        "title": "ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems for net-new innovation, digital growth and scale",
        "summary": "SANTA CLARA, Calif., October 23, 2024--ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems",
        "first_p": "ServiceNow (NOW) reported $2.8 billion in revenue for the quarter ended September 2024, representing a year-over-year increase of 22.3%. EPS of $3.72 for the same period compares to $2.92 a year ago.",
        "last_p": "Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report"
    },
    "108": {
        "ticker": "NOW",
        "date_published": "2024-10-23",
        "title": "ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems for net-new innovation, digital growth and scale",
        "summary": "SANTA CLARA, Calif., October 23, 2024--ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems",
        "first_p": "ServiceNow (NOW) came out with quarterly earnings of $3.72 per share, beating the Zacks Consensus Estimate of $3.46 per share. This compares to earnings of $2.92 per share a year ago. These figures are adjusted for non-recurring items.",
        "last_p": "ServiceNow, Inc. (NOW) : Free Stock Analysis Report"
    },
    "109": {
        "ticker": "NOW",
        "date_published": "2024-10-23",
        "title": "ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems for net-new innovation, digital growth and scale",
        "summary": "SANTA CLARA, Calif., October 23, 2024--ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems",
        "first_p": "Enterprise workflow software maker ServiceNow (NYSE:NOW) reported Q3 CY2024 results exceeding the market’s revenue expectations , with sales up 22.2% year on year to $2.80 billion. Its non-GAAP profit of $3.72 per share was also 7.8% above analysts’ consensus estimates.",
        "last_p": "The customer acquisition cost (CAC) payback period measures the months a company needs to recoup the money spent on acquiring a new customer. This metric helps assess how quickly the business can break even on its sales and marketing investments."
    },
    "110": {
        "ticker": "NOW",
        "date_published": "2024-10-23",
        "title": "ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems for net-new innovation, digital growth and scale",
        "summary": "SANTA CLARA, Calif., October 23, 2024--ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems",
        "first_p": "SANTA CLARA, Calif. (AP) — SANTA CLARA, Calif. (AP) — ServiceNow Inc. (NOW) on Wednesday reported third-quarter earnings of $432 million.",
        "last_p": "The results surpassed Wall Street expectations. The average estimate of 11 analysts surveyed by Zacks Investment Research was for earnings of $3.46 per share."
    },
    "111": {
        "ticker": "NOW",
        "date_published": "2024-10-23",
        "title": "ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems for net-new innovation, digital growth and scale",
        "summary": "SANTA CLARA, Calif., October 23, 2024--ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems",
        "first_p": "(Reuters) - ServiceNow forecast fourth-quarter subscription revenue above Wall Street estimates on Wednesday, indicating a robust demand as businesses turn to its AI-driven products for managing their IT services.",
        "last_p": "ServiceNow now expects annual subscription revenue to be between $10.655 billion and $10.660 billion, up from its prior forecast of $10.575 billion to $10.585 billion."
    },
    "112": {
        "ticker": "NOW",
        "date_published": "2024-10-23",
        "title": "ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems for net-new innovation, digital growth and scale",
        "summary": "SANTA CLARA, Calif., October 23, 2024--ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems",
        "first_p": "ServiceNow exceeds guidance across all Q3 2024 topline growth and profitability metrics; raises 2024 subscription revenues guidance",
        "last_p": "View source version on businesswire.com: https://www.businesswire.com/news/home/20241023215869/en/"
    },
    "113": {
        "ticker": "NOW",
        "date_published": "2024-10-23",
        "title": "ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems for net-new innovation, digital growth and scale",
        "summary": "SANTA CLARA, Calif., October 23, 2024--ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems",
        "first_p": "Google Cloud and Oracle leader brings extensive experience in enterprise innovation, transformation, and scale",
        "last_p": "ServiceNow (NYSE: NOW) is putting AI to work for people. We move with the pace of innovation to help customers transform organizations across every industry while upholding a trustworthy, human centered approach to deploying our products and services at scale. Our AI platform for business transformation connects people, processes, data, and devices to increase productivity and maximize business outcomes. For more information, visit: www.servicenow.com."
    },
    "114": {
        "ticker": "NOW",
        "date_published": "2024-10-23",
        "title": "ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems for net-new innovation, digital growth and scale",
        "summary": "SANTA CLARA, Calif., October 23, 2024--ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems",
        "first_p": "New solution enables \"Transformation without Disruption\" by combining ServiceNow’s AI Platform with Rimini Street’s proven enterprise software support without the costs of mandatory upgrades, migrations or re-platforming",
        "last_p": "View source version on businesswire.com: https://www.businesswire.com/news/home/20241023412490/en/"
    },
    "115": {
        "ticker": "NOW",
        "date_published": "2024-10-23",
        "title": "ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems for net-new innovation, digital growth and scale",
        "summary": "SANTA CLARA, Calif., October 23, 2024--ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems",
        "first_p": "Global, multi-year deal to accelerate the identification, development, and validation of skills to help employees and organizations prepare for the future of work",
        "last_p": "Media Contacts:"
    },
    "116": {
        "ticker": "NOW",
        "date_published": "2024-10-23",
        "title": "ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems for net-new innovation, digital growth and scale",
        "summary": "SANTA CLARA, Calif., October 23, 2024--ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems",
        "first_p": "Companies to co-develop native AI Agents using NVIDIA NIM Agent Blueprints within the ServiceNow platform",
        "last_p": "1 Reversing a Credit-Card Charge Has Never Been Easier—or More Abused - WSJ"
    },
    "117": {
        "ticker": "NOW",
        "date_published": "2024-10-23",
        "title": "ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems for net-new innovation, digital growth and scale",
        "summary": "SANTA CLARA, Calif., October 23, 2024--ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems",
        "first_p": "Databricks’ Delta Sharing will enable ServiceNow to offer Zero Copy, high-bandwidth, bi-directional, and secure integration with the Databricks Data Intelligence Platform so customers can turn data into instant, AI-powered action",
        "last_p": "Contacts"
    },
    "118": {
        "ticker": "NOW",
        "date_published": "2024-10-23",
        "title": "ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems for net-new innovation, digital growth and scale",
        "summary": "SANTA CLARA, Calif., October 23, 2024--ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems",
        "first_p": "Zero Copy integration links data-rich insights with operational actions, using Snowflake’s powerful enterprise AI platform to trigger ServiceNow workflows",
        "last_p": "Contacts"
    },
    "119": {
        "ticker": "NOW",
        "date_published": "2024-10-23",
        "title": "ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems for net-new innovation, digital growth and scale",
        "summary": "SANTA CLARA, Calif., October 23, 2024--ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems",
        "first_p": "Enhanced integrated data layer unifies business and technology data across the enterprise, powering all workflows and AI agents with real-time, secure access to data from any source",
        "last_p": "© 2024 ServiceNow, Inc. All rights reserved. ServiceNow, the ServiceNow logo, Now, and other ServiceNow marks are trademarks and/or registered trademarks of ServiceNow, Inc. in the United States and/or other countries. Other company names, product names, and logos may be trademarks of the respective companies with which they are associated."
    },
    "120": {
        "ticker": "NOW",
        "date_published": "2024-10-23",
        "title": "ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems for net-new innovation, digital growth and scale",
        "summary": "SANTA CLARA, Calif., October 23, 2024--ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems",
        "first_p": "This is a big week for earnings, especially in the S&P 500. Several hundred companies will report including the first of the Magnificent 7, which is Tesla. But there are other companies to keep an eye on as well including infrastructure plays and several key companies in the consumer space.",
        "last_p": "United Rentals, Inc. (URI) : Free Stock Analysis Report"
    },
    "121": {
        "ticker": "NOW",
        "date_published": "2024-10-22",
        "title": "ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems for net-new innovation, digital growth and scale",
        "summary": "SANTA CLARA, Calif., October 23, 2024--ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems",
        "first_p": "SANTA CLARA, Calif., October 22, 2024--(BUSINESS WIRE)--ServiceNow (NYSE: NOW), the AI platform for business transformation, has been named a Leader in the 2024 Gartner Magic Quadrant for Enterprise Low-Code Application Platforms. This marks the fifth consecutive year where ServiceNow has been positioned as a Leader. This recognition was based on an evaluation of ServiceNow’s Completeness of Vision and Ability to Execute. ServiceNow attributes this recognition to its commitment to innovation and consistent delivery of customer demand for GenAI and workflow automation features.",
        "last_p": "© 2024 ServiceNow, Inc. All rights reserved. ServiceNow, the ServiceNow logo, Now, and other ServiceNow marks are trademarks and/or registered trademarks of ServiceNow, Inc. in the United States and/or other countries. Other company names, product names, and logos may be trademarks of the respective companies with which they are associated."
    },
    "122": {
        "ticker": "NOW",
        "date_published": "2024-10-22",
        "title": "ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems for net-new innovation, digital growth and scale",
        "summary": "SANTA CLARA, Calif., October 23, 2024--ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems",
        "first_p": "Enterprise workflow software maker ServiceNow (NYSE:NOW) will be announcing earnings results tomorrow after market hours. Here’s what you need to know.",
        "last_p": "This quarter, analysts are expecting ServiceNow’s revenue to grow 20% year on year to $2.75 billion, slowing from the 25% increase it recorded in the same quarter last year. Adjusted earnings are expected to come in at $3.45 per share."
    },
    "123": {
        "ticker": "NOW",
        "date_published": "2024-10-21",
        "title": "ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems for net-new innovation, digital growth and scale",
        "summary": "SANTA CLARA, Calif., October 23, 2024--ServiceNow and Rimini Street partner on new enterprise software model to unlock value in existing ERP systems",
        "first_p": "Growth stocks are attractive to many investors, as above-average financial growth helps these stocks easily grab the market's attention and produce exceptional returns. But finding a growth stock that can live up to its true potential can be a tough task.",
        "last_p": "Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report"
    }
}