{
     "0": {
          "ticker": "META",
          "date_published": "2024-11-29",
          "title": "Meta Platforms Retakes Key Level After Pullback From Record Highs",
          "summary": "Meta stock gained Friday and retook a key moving average, despite news Australia will ban social media for young users.",
          "link": "https://finance.yahoo.com/news/why-meta-platforms-meta-stock-170332210.html?.tsrc=rss",
          "first_p": "We recently published a list of Top 8 Stocks To Buy In 8 Different Sectors for the Next 3 Months. In this article, we are going to take a look at where Meta Platforms, Inc. (NASDAQ:META) stands against other top stocks to buy in 8 different sectors for the next 3 months.",
          "last_p": "The company’s Reality Labs division, dedicated to virtual and augmented reality, reported $270 million in revenue, accounting for a small portion of overall earnings. Although this segment continues to operate at a loss, CEO Mark Zuckerberg underscores its long-term potential to transform how people socialize, work, and transact within virtual environments. Meta Platforms, Inc. (NASDAQ:META) remains committed to significant investments in hardware, software, and content development to advance its vision for the metaverse.",
          "whole_article": "We recently published a list of Top 8 Stocks To Buy In 8 Different Sectors for the Next 3 Months. In this article, we are going to take a look at where Meta Platforms, Inc. (NASDAQ:META) stands against other top stocks to buy in 8 different sectors for the next 3 months.\nOn November 25, the stock market saw a significant surge, with the Dow Jones Industrial Average jumping 440 points to a new record close of 44,736.57. The S&P 500 also reached a new high, gaining 0.3% to 5,987.37, while the Russell 2000 index, which focuses on small-cap stocks, hit an all-time high, increasing 1.47% to 2,442.03. The Nasdaq also rose, closing 0.27% higher at 19,054.84. CNBC reported that the market’s strong performance was attributed to President-elect Donald Trump’s nomination of Scott Bessent, the founder of Key Square Group, as Treasury secretary. Investors are optimistic that Bessent, a hedge fund manager, will be supportive of the equity market and help mitigate some of Trump’s protectionist policies, such as his stance on tariffs.\nUS Stocks Poised for Continued Growth\nIn an interview with CNBC on November 25, Brian Belski, Chief Investment Officer at BMO Capital Markets, expressed his bullish stance on the US stock market, stating that it remains the best asset in the world. He emphasized that despite the negativity and doubts surrounding the market, his team has consistently maintained a bullish stance since 2009.\nBelski pointed out that many investors are too focused on valuation, which he believes is the world’s worst metric for predicting forward performance. Instead, he emphasizes the importance of earnings growth consistency, where the US is expected to outperform other regions.\nHe also highlighted the potential for catch-up growth in the financial sector, particularly in the areas of scale, asset managers, and discretionary spending. His team’s research suggests that earnings in the US financial sector are massively understated, and he expects a big catch-up trade on the earnings front.\nRegarding valuation, Belski dismissed the idea of assigning a specific valuation metric, such as a P/E ratio, as simplistic. Instead, his team uses a macro P/E longer-term trend and a dividend discount model to evaluate the market. He believes the S&P 500 can reach 6,700, driven by US growth and earnings consistency.\nBrian Belski has been bullish on small-cap stocks for well over a year and believes small-cap stocks are a good value play. He also implies that small-cap stocks are undervalued, citing various valuation metrics such as price-to-sales, and price-to-book, as well as operating metrics such as return on assets and return on equity. He suggests that these metrics indicate that small-cap stocks are a good value investment opportunity.\nStory Continues\nThe US stock market continues to show resilience and strength, with the Dow Jones Industrial Average and S&P 500 reaching new highs. The nomination of Scott Bessent as Treasury secretary has injected a sense of optimism into the market. With the market’s strong performance and positive outlook, investors are well-positioned to take advantage of the current trend. With that in context, let’s take a look at the top 8 stocks to buy in 8 different sectors for the next 3 months.\nOur Methodology\nTo compile our list of the top 8 stocks to buy in 8 different sectors for the next 3 months, we used Insider Monkey’s database to research stocks in 8 different sectors. We picked stocks from different sectors that were the most popular among elite money managers. The final list is ranked in ascending order of the number of hedge fund holders, as of Q3 2024.\nWhy do we care about what hedge funds do? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nWhy Meta Platforms, Inc. (META) is the Top Stock to Buy in 8 Different Sectors for the Next 3 Months?\nPhoto by Timothy Hales Bennett on Unsplash\nMeta Platforms, Inc. (NASDAQ:META)\nNumber of Hedge Fund Holders: 235\nSector: Communication Services\nMeta Platforms, Inc. (NASDAQ:META) is a leading social media and technology company, known for Facebook, Instagram, and WhatsApp. The company’s revenue is primarily driven by digital advertising. However, the company is investing heavily in the metaverse and is focusing on virtual and augmented reality.\nOn October 30, Meta Platforms, Inc. (NASDAQ:META) announced its financial results for the third quarter ending September 30. The company reported $40.59 billion in revenue, reflecting a 19% year-over-year increase. The company’s operating margin rose to 43%, compared to 40% in the same quarter last year. The focus on user engagement continues to yield significant results, with Family Daily Active People (DAP) across its Family of Apps (FoA) reaching 3.29 billion, marking a 5% year-over-year growth. This success is attributed to AI-driven personalization, which enhances the user experience and fosters greater interaction. Additionally, the average price per ad increased by 11% year-over-year.\nThe company’s Reality Labs division, dedicated to virtual and augmented reality, reported $270 million in revenue, accounting for a small portion of overall earnings. Although this segment continues to operate at a loss, CEO Mark Zuckerberg underscores its long-term potential to transform how people socialize, work, and transact within virtual environments. Meta Platforms, Inc. (NASDAQ:META) remains committed to significant investments in hardware, software, and content development to advance its vision for the metaverse.\nOverall, META ranks 3rd on our list of top stocks to buy in 8 different sectors for the next 3 months. While we acknowledge the potential of META to grow, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. If you are looking for an AI stock that is more promising than META but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nREAD NEXT: 8 Best Wide Moat Stocks to Buy Now and 30 Most Important AI Stocks According to BlackRock\nDisclosure: None. This article is originally published at Insider Monkey.\nView Comments"
     }
},{
     "1": {
          "ticker": "META",
          "date_published": "2024-11-29",
          "title": "Meta Platforms Retakes Key Level After Pullback From Record Highs",
          "summary": "Meta stock gained Friday and retook a key moving average, despite news Australia will ban social media for young users.",
          "link": "https://finance.yahoo.com/news/microsoft-ftc-probe-not-a-complete-shocker-analyst-says-153516617.html?.tsrc=rss",
          "first_p": "Microsoft stock (MSFT) lagged its Big Tech peers on Friday after news broke late Wednesday that the Federal Trade Commission has opened a broad antitrust probe into the tech giant.",
          "last_p": "\"We believe there will be major shifts in policy against Big Tech over the coming years with Trump in the White House and Khan out at the FTC ... we believe [it is] just a matter of time and will remove a huge thorn in the side of the tech world,\" Ives wrote.",
          "whole_article": "Microsoft stock (MSFT) lagged its Big Tech peers on Friday after news broke late Wednesday that the Federal Trade Commission has opened a broad antitrust probe into the tech giant.\nAfter falling as much as 0.8% on Friday, Microsoft shares were roughly unchanged near 11:30 a.m. ET. The Nasdaq rose as much as 0.7% while the S&P 500 rose 0.6% in a holiday-shortened trading session.\nBut at least one Wall Street analyst sees the news coming as no surprise and expects changes at the FTC under the Trump administration to make antitrust worries in the tech space fade away.\n\"In our view as the dark days for tech with Lina [Khan] at the FTC appear numbered now with a Trump White House, it is not a complete shocker that Wednesday after the bell the FTC announced a broad sweeping investigation into Microsoft as a final shot across the bow at Big Tech from Kahn before she departs,\" Wedbush analyst Dan Ives wrote in a note to clients on Friday.\nIves added this probe \"is much more bark than bite\" and will become a secondary concern for the company once President-elect Donald Trump names a new FTC leader.\n• USD\n(MSFT)\nFollow\nView Quote Details\nAccording to Bloomberg, which broke the story, the FTC's request to Microsoft is \"hundreds of pages long\" and focuses, among other things, on how the company bundles its cloud services with other software, like its productivity suite (Word, Outlook, Excel) and security offerings.\nCurrent FTC Chair Lina Khan has aggressively pursued antitrust actions against tech giants, including Alphabet (GOOG, GOOGL), Apple (AAPL), and now Microsoft.\nThe stocks of Apple, Microsoft, and Alphabet are all trailing the S&P 500's (^GSPC) 26% year-to-date gain.\nAlphabet is currently facing the most serious threat, with a federal judge finding earlier this year that the company's Google search engine was run as an illegal monopoly. Earlier this month, the DOJ asked the company to sell its Chrome browser and divest its Android mobile operating system.\nFederal Trade Commission (FTC) chair Lina Khan testifies before the House Appropriations Subcommittee on May 15, 2024, in Washington, D.C. (Kevin Dietsch/Getty Images) · Kevin Dietsch via Getty Images\nFollowing Trump's election win, investor optimism grew that these various antitrust threats would disappear under his administration. Some legal experts, however, are less confident, as Yahoo Finance's Alexis Keenan reported.\nIves, for his part, sees the recent era in which regulators sought to limit Big Tech deals and scrutinize the world's largest companies as one that is coming to an end.\n\"We believe there will be major shifts in policy against Big Tech over the coming years with Trump in the White House and Khan out at the FTC ... we believe [it is] just a matter of time and will remove a huge thorn in the side of the tech world,\" Ives wrote.\nStory Continues\n\"As someone that has covered tech throughout the Microsoft vs. US Government trial/soap opera for many years in the 1990's into an ultimate win for Redmond, we believe negotiations and remedies will be much smaller than the fears for Google, Apple, MSFT, Meta and Big Tech.\"\nClick here for the latest technology news that will impact the stock market\nRead the latest financial and business news from Yahoo Finance\nView Comments"
     }
},{
     "2": {
          "ticker": "META",
          "date_published": "2024-11-29",
          "title": "Meta Platforms Retakes Key Level After Pullback From Record Highs",
          "summary": "Meta stock gained Friday and retook a key moving average, despite news Australia will ban social media for young users.",
          "link": "https://finance.yahoo.com/news/meta-build-massive-10b-subsea-152739667.html?.tsrc=rss",
          "first_p": "Reportedly intending to build a 25,000-mile (40,000-kilometer fiber-optic subsea cable costing more than $10 billion is Meta Platforms (NASDAQ:META), Tech Crunch said Friday.",
          "last_p": "Sources close to Meta verified the project is in its early phases and will be exclusively owned and run by the business. The cable is meant to offer a worldwide dedicated data traffic network, therefore improving Meta's infrastructure capacities.",
          "whole_article": "Reportedly intending to build a 25,000-mile (40,000-kilometer fiber-optic subsea cable costing more than $10 billion is Meta Platforms (NASDAQ:META), Tech Crunch said Friday.\nWarning! GuruFocus has detected 4 Warning Sign with META.\nSources close to Meta verified the project is in its early phases and will be exclusively owned and run by the business. The cable is meant to offer a worldwide dedicated data traffic network, therefore improving Meta's infrastructure capacities.\nSunil Tagare, a subsea cable specialist who first revealed Meta's intentions in October, first estimates a starting budget of $2 billion, but as the project develops, expenditures are projected to surpass $10 billion.\nProposed to extend from the U.S. east coast to India via South Africa and back to the U.S. west coast via Australia, the cable creates a \"W\" form. Plans have been developed; no actual assets are in place, and Meta has not yet commented on the budget. Early 2025 should bring further specifics about the project. This expenditure would fit the internet behemoth's plan to grow its worldwide infrastructure to meet rising data needs from its platforms.\nThis article first appeared on GuruFocus.\n\nView Comments"
     }
},{
     "3": {
          "ticker": "META",
          "date_published": "2024-11-29",
          "title": "Meta Platforms Retakes Key Level After Pullback From Record Highs",
          "summary": "Meta stock gained Friday and retook a key moving average, despite news Australia will ban social media for young users.",
          "link": "https://finance.yahoo.com/news/metas-10-billion-internet-power-142347484.html?.tsrc=rss",
          "first_p": "Meta (NASDAQ:META) is taking control of the internetliterally. The company behind Facebook, Instagram, and WhatsApp just announced plans to build a massive 40,000-kilometer subsea cable that will circle the globe. This isn't your average infrastructure project; it's a $10 billion bet to future-proof Meta's platforms, which already account for a staggering 10% of global fixed and 22% of mobile internet traffic. The cable's \"W\"-shaped route will link the U.S., South Africa, India, and Australia, avoiding geopolitical hotspots while securing a dedicated pipe for Meta's data. With the internet's demand skyrocketing and AI driving even more traffic, Meta's strategy to own the pipesstart to finishis nothing short of visionary.",
          "last_p": "Warning! GuruFocus has detected 4 Warning Sign with META.",
          "whole_article": "Meta (NASDAQ:META) is taking control of the internetliterally. The company behind Facebook, Instagram, and WhatsApp just announced plans to build a massive 40,000-kilometer subsea cable that will circle the globe. This isn't your average infrastructure project; it's a $10 billion bet to future-proof Meta's platforms, which already account for a staggering 10% of global fixed and 22% of mobile internet traffic. The cable's \"W\"-shaped route will link the U.S., South Africa, India, and Australia, avoiding geopolitical hotspots while securing a dedicated pipe for Meta's data. With the internet's demand skyrocketing and AI driving even more traffic, Meta's strategy to own the pipesstart to finishis nothing short of visionary.\nWarning! GuruFocus has detected 4 Warning Sign with META.\nAnd here's where things get really interesting: India. With the largest number of Facebook, Instagram, and WhatsApp users in the world, India is more than just a key marketit's becoming the epicenter of Meta's next big move. The company could use the subsea cable to power up its AI ambitions, leveraging India's cheap computing costs to train advanced AI models. Talk about a two-for-one deal: global connectivity and a potential AI superhub. It's a smart play for a company that makes more money outside the U.S. than in it. Sources say India's exploding data center market, coupled with demand for AI-driven services, makes it the perfect landing point.\nThis isn't just a tech story; it's a power shift. For decades, subsea cables were the domain of telecom giants working in groups. Now, big tech is rewriting the rules. Meta's move mirrors Google's (NASDAQ:GOOG) strategyown the infrastructure, control the flow. And the stakes couldn't be higher. With cables increasingly targeted in global conflicts and regulators eyeing tighter control, Meta's exclusive ownership ensures security, efficiency, and independence. Sure, it'll take years to build, but when it's done, Meta won't just connect the worldit'll control how the world connects. Investors, take note: this is infrastructure dominance at its finest.\nThis article first appeared on GuruFocus.\n\nView Comments"
     }
},{
     "4": {
          "ticker": "META",
          "date_published": "2024-11-29",
          "title": "Meta Platforms Retakes Key Level After Pullback From Record Highs",
          "summary": "Meta stock gained Friday and retook a key moving average, despite news Australia will ban social media for young users.",
          "link": "https://finance.yahoo.com/news/meta-platforms-inc-meta-trending-140017173.html?.tsrc=rss",
          "first_p": "Meta Platforms (META) has been one of the most searched-for stocks on Zacks.com lately. So, you might want to look at some of the facts that could shape the stock's performance in the near term.",
          "last_p": "Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report",
          "whole_article": "Meta Platforms (META) has been one of the most searched-for stocks on Zacks.com lately. So, you might want to look at some of the facts that could shape the stock's performance in the near term.\nShares of this social media company have returned +0.3% over the past month versus the Zacks S&P 500 composite's +3.1% change. The Zacks Internet - Software industry, to which Meta Platforms belongs, has gained 4.9% over this period. Now the key question is: Where could the stock be headed in the near term?\nAlthough media reports or rumors about a significant change in a company's business prospects usually cause its stock to trend and lead to an immediate price change, there are always certain fundamental factors that ultimately drive the buy-and-hold decision.\nRevisions to Earnings Estimates\nHere at Zacks, we prioritize appraising the change in the projection of a company's future earnings over anything else. That's because we believe the present value of its future stream of earnings is what determines the fair value for its stock.\nOur analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.\nFor the current quarter, Meta Platforms is expected to post earnings of $6.74 per share, indicating a change of +26.5% from the year-ago quarter. The Zacks Consensus Estimate has changed +6.4% over the last 30 days.\nFor the current fiscal year, the consensus earnings estimate of $22.62 points to a change of +52.1% from the prior year. Over the last 30 days, this estimate has changed +5.4%.\nFor the next fiscal year, the consensus earnings estimate of $25.16 indicates a change of +11.2% from what Meta Platforms is expected to report a year ago. Over the past month, the estimate has changed +3.2%.\nHaving a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Meta Platforms is rated Zacks Rank #2 (Buy).\nStory Continues\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS\nProjected Revenue Growth\nWhile earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.\nFor Meta Platforms, the consensus sales estimate for the current quarter of $47 billion indicates a year-over-year change of +17.2%. For the current and next fiscal years, $163.11 billion and $187.07 billion estimates indicate +20.9% and +14.7% changes, respectively.\nLast Reported Results and Surprise History\nMeta Platforms reported revenues of $40.59 billion in the last reported quarter, representing a year-over-year change of +18.9%. EPS of $6.03 for the same period compares with $4.39 a year ago.\nCompared to the Zacks Consensus Estimate of $40.21 billion, the reported revenues represent a surprise of +0.95%. The EPS surprise was +16.18%.\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\nValuation\nNo investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\nWhile comparing the current values of a company's valuation multiples, such as price-to-earnings (P/E), price-to-sales (P/S) and price-to-cash flow (P/CF), with its own historical values helps determine whether its stock is fairly valued, overvalued, or undervalued, comparing the company relative to its peers on these parameters gives a good sense of the reasonability of the stock's price.\nThe Zacks Value Style Score (part of the Zacks Style Scores system), which pays close attention to both traditional and unconventional valuation metrics to grade stocks from A to F (an An is better than a B; a B is better than a C; and so on), is pretty helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nMeta Platforms is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nConclusion\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Meta Platforms. However, its Zacks Rank #2 does suggest that it may outperform the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMeta Platforms, Inc. (META) : Free Stock Analysis Report\nTo read this article on Zacks.com click here.\nZacks Investment Research\nView Comments"
     }
},{
     "5": {
          "ticker": "META",
          "date_published": "2024-11-29",
          "title": "Meta Platforms Retakes Key Level After Pullback From Record Highs",
          "summary": "Meta stock gained Friday and retook a key moving average, despite news Australia will ban social media for young users.",
          "link": "https://finance.yahoo.com/news/meta-faces-trial-october-unfair-125217806.html?.tsrc=rss",
          "first_p": "MADRID (Reuters) - Facebook owner Meta Platforms will face a trial in October 2025 in Spain over a 551 million euro ($582 million)complaint lodged by more than 80 media companies accusing it of unfair competition in advertising, a Madrid court said on Friday.",
          "last_p": "Some of these attempts have backfired in countries like Canada and Australia, where Meta has blocked users from reposting news articles.",
          "whole_article": "MADRID (Reuters) - Facebook owner Meta Platforms will face a trial in October 2025 in Spain over a 551 million euro ($582 million)complaint lodged by more than 80 media companies accusing it of unfair competition in advertising, a Madrid court said on Friday.\nThe hearings will be held on Oct. 1 and 2, the 15th Madrid commercial court said in a statement.\nThe AMI media association, which represents 87 Spanish media firms, filed a lawsuit last year alleging Meta violated EU data protection rules between 2018 and 2023.\nThe newspapers argue that Meta's \"massive\" and \"systematic\" use of the personal data of its Facebook, Instagram and Whatsapp platform users gives it an unfair advantage in designing and offering personalised ads, which they say constitutes unfair competition.\nA Meta spokesperson did not immediately respond to a request for comment.\nListed newspapers publishers Prisa, which owns El Pais newspaper, and Vocento, which owns ABC Newspaper, are among the complainants.\nSeparately, Spanish TV and radio broadcasters associations UTECA and AERC said last month they had filed a 160 million euro lawsuit against Meta on the same grounds.\nThe Spanish suits represent efforts by legacy media to fight tech giants in both courts and legislatures to preserve their revenue, arguing such firms should pay fair fees for using and sharing their content.\nSome of these attempts have backfired in countries like Canada and Australia, where Meta has blocked users from reposting news articles.\nIn its other markets, Meta has been scaling back its promotion of news and political content to drive traffic and says news links now represent only a fraction of users' feeds.\n($1 = 0.9471 euros)\n(Reporting by Inti Landauro, editing by Aislinn Laing and Jason Neely)\nView Comments"
     }
},{
     "6": {
          "ticker": "META",
          "date_published": "2024-11-29",
          "title": "Meta Platforms Retakes Key Level After Pullback From Record Highs",
          "summary": "Meta stock gained Friday and retook a key moving average, despite news Australia will ban social media for young users.",
          "link": "https://finance.yahoo.com/news/former-meta-platforms-meta-google-120721707.html?.tsrc=rss",
          "first_p": "We recently compiled a list of the 15 Trending AI Stocks on Latest Ratings and News. In this article, we are going to take a look at where Meta Platforms, Inc. (NASDAQ:META) stands against the other AI stocks.",
          "last_p": "Meta Platforms, Inc. (NASDAQ:META) engages in the development of products that enable people to connect and share with friends and family. On November 27, tech news platform Silicon Republic reported that a former executive at Meta had teamed up with a former Google executive to launch a new start-up that develops operating systems for AI agents. The startup has already raised nearly $50 million in a funding round, per the report. David Singleton, the former CTO of financial services firm Stripe, is also a partner.",
          "whole_article": "We recently compiled a list of the 15 Trending AI Stocks on Latest Ratings and News. In this article, we are going to take a look at where Meta Platforms, Inc. (NASDAQ:META) stands against the other AI stocks.\nLatest reports indicate that billionaire Masayoshi Son, the founder of Japanese multinational tech firm Softbank, is set to meet Indian Prime Minister Narendra Modi. Per news agency Reuters, the meeting comes as Son eyes more artificial intelligence and technology bets in the third-largest economy in Asia. Reuters further claims that Son already met Mukesh Ambani - the richest man in the South Asian country and the chief of prominent conglomerate Reliance Industries. According to sources quoted by Reuters, the duo discussed potential artificial intelligence opportunities in India. CNBC had earlier reported that Softbank is also exploring an additional $1.5 billion investment in AI startup OpenAI.\nRead more about these developments by accessing 10 Best AI Data Center Stocks and 10 Buzzing AI Stocks According to Goldman Sachs.\nMeanwhile, another billionaire on the other side of the world is mulling further investments in AI as well. Per a report by news publication The Wall Street Journal, xAI, the AI startup of billionaire Elon Musk, is considering the release of a standalone consumer application that follows the success of ChatGPT by OpenAI. The xAI application would be powered by the Grok bot that the startup is marketing. The app will likely arrive after xAI closes its next funding round, which could reach $5 billion and value the company at $50 billion, per the Financial Times. If successful in raising this amount, xAI would take total raised funding to $11 billion.\nREAD ALSO: 30 Most Important AI Stocks According to BlackRock and Beyond the Tech Giants: 35 Non-Tech AI Opportunities.\nFor this article, we selected AI stocks by combing through news articles, stock analysis, and press releases. These stocks are also popular among hedge funds. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nA team of developers working in unison to create the company's messaging application.\nMeta Platforms, Inc. (NASDAQ:META)\nNumber of Hedge Fund Holders: 235\nMeta Platforms, Inc. (NASDAQ:META) engages in the development of products that enable people to connect and share with friends and family. On November 27, tech news platform Silicon Republic reported that a former executive at Meta had teamed up with a former Google executive to launch a new start-up that develops operating systems for AI agents. The startup has already raised nearly $50 million in a funding round, per the report. David Singleton, the former CTO of financial services firm Stripe, is also a partner.\nStory Continues\nOverall, META ranks 3rd on our list of the trending AI stocks on latest ratings and news. While we acknowledge the potential of META as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than META but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nREAD NEXT: 8 Best Wide Moat Stocks to Buy Now and 30 Most Important AI Stocks According to BlackRock.\nDisclosure: None. This article is originally published at Insider Monkey.\nView Comments"
     }
},{
     "7": {
          "ticker": "META",
          "date_published": "2024-11-29",
          "title": "Meta Platforms Retakes Key Level After Pullback From Record Highs",
          "summary": "Meta stock gained Friday and retook a key moving average, despite news Australia will ban social media for young users.",
          "link": "https://finance.yahoo.com/news/tech-firms-criticize-australia-rushed-093204906.html?.tsrc=rss",
          "first_p": "Australia's lawmakers have voted to ban those under the age of 16 from using social media—even if their parents are okay with it.",
          "last_p": "Last year, France passed legislation that requires children under 15 to get a parent’s permission before getting a social media platform, but local media reports that technical challenges have led to a lack of enforcement. Norway is also hoping to enforce a strict minimum age of 15 to access social media.",
          "whole_article": "Australia's lawmakers have voted to ban those under the age of 16 from using social media—even if their parents are okay with it.\nOn Friday morning, Australia’s house of representatives approved the bill with bipartisan support, ending a legislative process that started just a week ago. Social media giants swiftly criticized the new bill, and raised concerns about the “rushed” process to get it passed and missing details about enforcement.\nA Meta spokesperson said the U.S. company respected Australia’s decision, but said it was “concerned about the process which rushed the legislation.”\n“Last week, the Parliament’s own committee said the ‘causal link with social media remains unclear’ with respect to the mental health of young Australians,” the spokesperson added. “This demonstrates the lack of evidence underpinning the legislation and suggests this was a predetermined process.”\nMeta owns both Facebook and Instagram.\nTikTok also said it was “important that the [Australian] government works closely with industry to fix issues created by this rushed process.”\nA Snap spokesperson argued there are “many unanswered questions about how the law will be implemented in practice,” and said it will work closely with authorities over the next 12 months to develop an approach that balances safety, privacy, and practicality.\nEffects on kids\nSome research shows that prolonged exposure to social media increases the risk of negative effects like anxiety or depression. Yet experts are divided on whether a blanket ban like Australia’s is the right solution, worrying that a polarized debate risks creating a one-size-fits-all solution. Other experts worry that social media platforms may be the only available option for isolated young people.\nSocial media companies had raised concerns in the days leading up to the bill. X owner Elon Musk also chimed in, suggesting last week that the bill “seems like a backdoor way to control access to the Internet by all Australians.” (Musk has been a frequent bugbear of the Australian government, refusing to comply with Australian government orders to take down content worldwide.)\nAustralian Prime Minister Anthony Albanese, who faces an election early next year, argues the legislation is needed to protect young people. He’s also painted social media as a tool for scammers and online predators, as well as a driver of anxiety.\nThe law received support from both of Australia’s major political parties, as well as parent groups. Yet it’s still unclear how the law will work. The legislations asks tech firms to take “reasonable steps” to prevent underage users from accessing social media, or face fines as high as 50 million Australian dollars ($32 million) if they fail to comply.\nStory Continues\nThe ban is expected to control access to platforms like Facebook, Snapchat, Instagram, X, and Reddit. Exemptions are likely to be given for messaging and education-related services like YouTube, Google Classroom, and WhatsApp. The ban will take effect from late 2025, but does not give details on how tech companies are expected to verify a user’s age.\nCritics raise privacy concerns\nCritics say a ban also raises privacy concerns and could create more risks for children.\nThe Australian Child Rights Taskforce pointed out that platforms will now be discouraged from offering child safety features, meaning younger users who somehow gain access to social media won’t be protected.\nThe Digital Industry Group Inc., a non-profit association in Australia, warned the ban could push younger people to darker places on the internet that lack the safety guardrails on mainstream platforms.\nAustralia’s social media ban is one of the toughest targeting Big Tech, but it’s not without precedent.\nLast year, France passed legislation that requires children under 15 to get a parent’s permission before getting a social media platform, but local media reports that technical challenges have led to a lack of enforcement. Norway is also hoping to enforce a strict minimum age of 15 to access social media.\nU.S. states have also targeted social media. New York and California passed legislation aimed at shielding underage users from recommendation algorithms. Utah and Arkansas have tried to pass age-related restrictions, though those have been challenged in court.\nStill, Australia’s ban is tougher by denying children access to social media, even if they get parental permission.\nThis story was originally featured on Fortune.com\nView Comments"
     }
},{
     "8": {
          "ticker": "META",
          "date_published": "2024-11-29",
          "title": "Meta Platforms Retakes Key Level After Pullback From Record Highs",
          "summary": "Meta stock gained Friday and retook a key moving average, despite news Australia will ban social media for young users.",
          "link": "https://finance.yahoo.com/news/australian-social-media-ban-started-065010311.html?.tsrc=rss",
          "first_p": "By Byron Kaye",
          "last_p": "\"I'm pleased to see that it's got as far as it has in Australia,\" said Robert French, the former High Court judge commissioned by Malinauskas in May to report on whether a state-based age restriction would be possible.",
          "whole_article": "By Byron Kaye\nSYDNEY (Reuters) - Since Meta whistleblower Frances Haugen aired internal emails in 2021 showing the tech giant knew of social media's mental health impacts on teenagers, world leaders have agonised over how to curb the technology's addictive pull on young minds.\nEven a 2023 recommendation by the U.S. surgeon general to put health warnings on social media, blaming it for what he called a teenage mental health crisis, could not help lawmakers from Florida to France navigate resistance on grounds of free speech, privacy and the limits of age-checking technology.\nThe spark that ended the stalemate was when the wife of the leader of Australia's second-smallest state read The Anxious Generation, a 2024 bestseller criticising social media by U.S. social psychologist Jonathan Haidt, and told her husband to take action.\n\"I remember precisely the moment that she said to me 'you've got to read this book and you've got to do something about it',\" South Australia Premier Peter Malinauskas told reporters in Adelaide on Friday, a day after the country's federal parliament passed a nationwide social media ban for youths under 16.\n\"I didn't reasonably anticipate it would take on so quickly,\" he added.\nMalinauskas's personal quest to restrict youth access to social media in his state, which represents just 7% of Australia's 27 million population, to the world's first national ban took just six months.\nThe speed underscores the depth of concern in the Australian electorate over the issue. Australian Prime Minister Anthony Albanese is due to hold an election in early 2025.\nAn Australian government YouGov survey found that 77% of Australians back the under-16 social media ban, up from 61% in August prior to the government's official announcement. Only 23% oppose the measure.\n\"It all originated here,\" said Rodrigo Praino, a professor of politics and public policy at South Australia's Flinders University.\n\"The federal government including the prime minister understood immediately that that was a problem that needed to be solved (and) best addressed if it's done nationwide. Allowing kids to indiscriminately use social media has become an issue globally.\"\nFAST MOVING\nWhen the father of four answered the call from his wife in May, Facebook and Instagram owner Meta had two months earlier said it would stop paying content royalties to news outlets globally, potentially triggering an Australian online copyright law.\nMeta's decision, in part, prompted the federal government to open a broad inquiry into societal impacts of social media, ranging from the merits of age-gating social media to the knock-on effects of Meta cancelling royalties.\nStory Continues\nOpposition lawmakers meanwhile began calling for age restrictions on social media against the backdrop of a legal fight between X and Australia's e-Safety regulator over the spread of false and graphic content related to two public knife attacks in Sydney in April.\nIn May, Rupert Murdoch's News Corp, the country's biggest newspaper publisher, began an editorial campaign to ban children under 16 from social media, calling \"Let Them Be Kids\".\nThrough the middle of 2024, News Corp mastheads and the parliamentary inquiry aired emotional accounts from parents whose children had taken or lost their lives as a result of bullying and body image problems tied to social media.\nAfter Malinauskas unveiled his state policy banning under-14s in September, Albanese was in the media the next day saying his government would enact a federal version by the end of the year.\n\"Parents want their kids off their phones and on the footy field,\" said Albanese, who like Malinauskas is from the centre-left Labor party. \"So do I.\"\nThe proposed South Australian ban was, however, largely in line with restrictions already legislated in countries including France and U.S. states like Florida, which held the door open for teens over 14 to keep using social media with parental permission.\nThe federal model Albanese's government introduced to parliament in November carried no parental discretion, with the explanation that it freed parents from the burden of playing a policing role.\nThe ban was roundly attacked by social media companies which complained it gave them full responsibility - and the threat of a A$49.5 million fine - without telling them how it would work. A trial of age-verification technology begins next year.\nA spokesperson for TikTok, which is hugely popular with teen users, said on Friday the process had been rushed and risked\npushing young people to \"darker corners of the internet\".\nThe left-leaning Greens rejected the law as rushed and unfair on young people, while some far-right lawmakers broke from their party's support and voted against it on concerns of government overreach and potential surveillance.\nBut with locked-in support from the government and most of the opposition, the law was passed just after 11pm on the last parliamentary day of the year. It takes effect one year later.\n\"I'm pleased to see that it's got as far as it has in Australia,\" said Robert French, the former High Court judge commissioned by Malinauskas in May to report on whether a state-based age restriction would be possible.\nSome of French's recommendations, including making the ban national and putting responsibility on platforms to take reasonable steps to keep minors out, are included in the final legislation.\n\"The basic sensible model is in place,\" French said by telephone.\n(Reporting by Byron Kaye; Editing by Michael Perry)\nView Comments"
     }
},{
     "9": {
          "ticker": "META",
          "date_published": "2024-11-28",
          "title": "Meta Platforms Retakes Key Level After Pullback From Record Highs",
          "summary": "Meta stock gained Friday and retook a key moving average, despite news Australia will ban social media for young users.",
          "link": "https://finance.yahoo.com/news/tiktok-meta-brace-australian-social-231537848.html?.tsrc=rss",
          "first_p": "(Bloomberg) -- Australia’s controversial new law barring under-16s from social media is one of the toughest crackdowns yet on platforms including Facebook and TikTok as governments worldwide grasp for ways to protect children from harmful content.",
          "last_p": "Why the Flying Experience Feels So Much Worse",
          "whole_article": "(Bloomberg) -- Australia’s controversial new law barring under-16s from social media is one of the toughest crackdowns yet on platforms including Facebook and TikTok as governments worldwide grasp for ways to protect children from harmful content.\nMost Read from Bloomberg\nIn Traffic-Weary Toronto, a Battle Breaks Out Over Bike Lanes\nIn Italy’s Motor City, Car-Free Options Are Growing\nNew York City’s ‘Living Breakwaters’ Brace for Stormier Seas\nThe blanket ban, passed late Thursday night, establishes some of the most stringent internet usage restrictions outside of China and other non-democratic regimes and could provide impetus to other governments to act. From Florida and Texas to France and the UK, authorities have attempted — or are considering — raising social-media age limits or tightening content oversight.\nLurking behind the debate, and driving the change, are the dark corners of social media that continue to extract a tragic toll. Like the 16-year-old boy, with a social media account filled with videos about hopelessness and death, who stepped in front of a train in Bayport, New York. Or the 15-year-old Australian schoolgirl who hanged herself from a tree at home in February 2022 after suffering years of social-media bullying.\nWhile Australia’s ban is wildly popular with voters — 77% support the move, according to a YouGov survey — it has unleashed a maelstrom of criticism from big tech. Major operators including Meta Platforms Inc. say the rules are ineffective or flawed, while X, owned by self-styled free speech absolutist Elon Musk, questioned whether the ban is lawful, heralding a possible court challenge. Academics worry about the unintended consequences of a blunt ban.\nUnder the new law, which will take effect in around 12 months, digital platforms including Snapchat, Instagram, and X will be responsible for enforcing the age limit, with penalties of as much as A$50 million ($32 million) for breaches. However, it’s still unclear how the platforms will verify ages, with the government already ruling out the use of official documents, such as a passport, due to privacy concerns. Kids who find a way past verification controls won’t be fined, and nor will their parents.\nThe law also threatens to upend the business model of some of the world’s most valuable companies as they face a global backlash against problems blamed on their services, such as increasing mental health issues, online scams, lower academic performance and grooming. A successful ban would deprive them of a key user group — millions of teenagers who are coveted by advertisers and who the companies want to lock in at an early age.\nStory Continues\nIn a statement, Meta said while it will respect the law, it was “concerned about the process which rushed the legislation through while failing to properly consider the evidence, what industry already does to ensure age-appropriate experiences, and the voices of young people.”\nThe World Health Organization issued one of the clearest warnings in September after studying social-media use among almost 280,000 school-aged children in 44 countries and regions, one of the largest surveys of its kind. The WHO warned of far-reaching consequences for adolescent development and their long-term health stemming from the rise in problematic social-media use.\nThe Geneva-based organization called for “immediate and sustained action.”\nThis week’s response from Australia, forcing through age thresholds irrespective of whether the child has parental permission, sets a new precedent.\n“We want Australian children to have a childhood,” Prime Minister Anthony Albanese said as he introduced the legislation last week. Social media platforms usually require account holders to be at least 13 years old.\nHowever, the simplicity of Australia’s solution has instead highlighted the complexity of the problem.\nYouTube, deemed by the Australian government to be a health- and education-related platform, is exempt from the ban, even though the comments section under videos can be as toxic as other corners of the internet. Online gaming and messaging services like WhatsApp and Discord are also exempt, even though they too can be used for bullying and grooming.\nSubscribe to The Bloomberg Australia Podcast on Apple, Spotify, on YouTube, or wherever you listen.\nOne of the biggest weaknesses of a ban on young people is that it doesn’t curb the production of harmful content, said Lisa Given, a professor of information sciences at RMIT University in Melbourne. She said platform owners should focus on disabling negative algorithms, which can overwhelm social-media users with content whether they like it or not. At the same time, there should be more investment in digital literacy for children and parents, Given said.\n“This legislation is really ill-conceived,” she said. “It’s a simple proposed fix for something that’s actually really complicated. And where did 16 come from? It seems like it was pulled out of the air.”\nPerhaps inevitably, almost all of the largest social-media companies including TikTok, X and Meta, which owns Facebook and Instagram, expressed concerns about the law in submissions to a truncated Senate inquiry before the bill passed.\nTikTok, owned by China’s ByteDance Ltd., said the legislation was “rushed” and “unworkable,” and riddled with “unanswered questions and unresolved concerns.”\nSnapchat-owner Snap Inc. said previous international attempts at broad and mandatory age verification had failed. X, known as Twitter before it was bought by Musk, said it had “serious concerns as to the lawfulness of the bill.”\nUnicef, the United Nations agency for children, said Australia’s ban would push young people into darker, unregulated places online. The law also risks compromising children’s rights and severing their access to information that’s vital to their welfare, Unicef said.\n“Instead of banning children, we should hold social media companies accountable for providing age-appropriate, secure, and supportive online environments,” Katie Maskiell, head of child rights policy and advocacy at Unicef Australia, said in a submission to the parliament.\nElected officials across the world tasked with overseeing social media find themselves in an uncomfortable squeeze. Many parents feel helpless and angry, and want children spending less time online. Their demands that governments step in are amplified by tragedies of youth suicides caused by social media bullying or sextortion. But it’s difficult to isolate the obvious dangers of social media without destroying its benefits.\n“It is impossible to be a teen in most parts of the world without social media,” Stephen Scheeler, the former head of Facebook in Australia and New Zealand, said in an interview with Bloomberg Television. “Controlling that access from a parental point of view or government point of view is not as easy as it sounds.”\nA number of other nations and US states have attempted to curb children’s access to social media, with limited success.\nA Florida bill prohibiting children under 14 from having social media accounts has faced legal challenges, as have moves from states such as Arkansas and Ohio that would require minors to secure parental approval to use social media.\nNorway wants to impose a minimum age of 15 on social media use after data showed many children under 13, the current age limit, still use popular platforms, the Guardian and other publications reported last month.\nEven if Australia’s ban proves hard or impossible to enforce, more countries are likely to take similar steps as concerns grow about the impact of social media on children, said Simon Kemp, founder of Singapore-based digital consulting firm Kepios Pte., which specializes in analyzing online behaviors.\n“I would be very surprised if we don’t see more of this,” Kemp said.\nFrance has renewed a push to keep under-15s off social media, Politico reported this week. French Education Minister Anne Genetet, a medical doctor by training, told Politico at a meeting of European Union education and youth ministers that the EU should follow Australia’s example.\nThe UK’s secretary of state for science and technology, Peter Kyle, has been in contact with the Australian government to learn more about its ban and its reasoning, according to the Guardian. Kyle has said he’s not ruling out a ban in future, but any measures must be founded on evidence.\n(Adds comment from Meta in seventh paragraph.)\nMost Read from Bloomberg Businessweek\nMusk’s Team of Budget-Slashing MAGA Billionaires Takes Shape\nWhat Happens When US Hospitals Go Big on Nurse Practitioners\nWhy the Flying Experience Feels So Much Worse\nTop Business Schools See Growing Minority Enrollment\nThe Charm Bracelet Shop That Keeps Going Viral\n©2024 Bloomberg L.P.\nView Comments"
     }
}